-- MySQL dump 10.13  Distrib 8.0.29, for macos12 (arm64)
--
-- Host: localhost    Database: health
-- ------------------------------------------------------
-- Server version	8.0.29

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `healthplan`
--

DROP TABLE IF EXISTS `healthplan`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `healthplan` (
  `member_id` int DEFAULT NULL,
  `template_id` int DEFAULT NULL,
  KEY `template_id` (`template_id`) USING BTREE,
  KEY `member_id` (`member_id`) USING BTREE,
  CONSTRAINT `healthplan_ibfk_2` FOREIGN KEY (`template_id`) REFERENCES `intervention_template` (`templateid`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `healthplan_ibfk_3` FOREIGN KEY (`member_id`) REFERENCES `t_member` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `healthplan`
--

LOCK TABLES `healthplan` WRITE;
/*!40000 ALTER TABLE `healthplan` DISABLE KEYS */;
INSERT INTO `healthplan` VALUES (1003,5),(1003,7),(1003,9),(10039,7),(10039,10),(1001,44),(1001,41),(1001,33),(1001,27),(1001,26),(1001,25),(1001,7),(1001,9),(1001,11),(1001,10),(1001,12),(1001,13),(1001,14),(1001,15),(1001,16);
/*!40000 ALTER TABLE `healthplan` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `intervention_template`
--

DROP TABLE IF EXISTS `intervention_template`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `intervention_template` (
  `templateid` int NOT NULL AUTO_INCREMENT,
  `templatename` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `templatestring` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `apply` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `templatestremark` varchar(256) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `templatestate` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  PRIMARY KEY (`templateid`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `intervention_template`
--

LOCK TABLES `intervention_template` WRITE;
/*!40000 ALTER TABLE `intervention_template` DISABLE KEYS */;
INSERT INTO `intervention_template` VALUES (5,'便秘','便秘','便秘','无','1'),(7,'荨麻疹','皮肤病','皮肤病疾病','无','1'),(9,'心脑血管血栓','血栓','心脑血管疾病','无','1'),(10,'尖锐湿疣','乳头瘤病毒','性传播疾病','无','1'),(11,'带状疱疹','皮肤病','皮肤病疾病','无','1'),(12,'皮肤过敏','皮肤病','皮肤病疾病','无','1'),(13,'白癜风','皮肤病','皮肤病疾病','无','1'),(14,'阴囊湿疹','皮肤病','皮肤病疾病','无','1'),(15,'水痘','皮肤病','皮肤病疾病','无','1'),(16,'粉刺','皮肤病','皮肤病疾病','无','1'),(17,'肺癌','癌症','呼吸疾病','无','1'),(18,'肺结核 ','结核','呼吸疾病','无','1'),(19,'肺炎','肺炎','呼吸疾病','无','1'),(20,'哮喘','哮喘','呼吸疾病','无','1'),(21,'小儿感冒','感冒','呼吸疾病','无','1'),(22,'羊癫疯','癫痫','神经疾病','无','1'),(23,'失眠症 ','失眠','神经疾病','无','1'),(24,'坐骨神经痛','偏痹','神经疾病','无','1'),(25,'神经衰弱','神劳','神经疾病','无','1'),(26,'头晕','头晕','神经疾病','无','1'),(27,'偏头痛','偏头风','神经疾病','无','1'),(28,'焦虑症','焦虑障碍','神经疾病','无','1'),(29,'肾结石','结石','肾疾病','无','1'),(33,'尿毒症','尿毒症','肾疾病','无','1'),(34,'尿道炎 ','炎症','肾疾病','无','1'),(35,'肾积水','肾积水','肾疾病','无','1'),(36,'肾囊肿','肾囊肿','肾疾病','无','1'),(39,'肾病综合征','综合征','肾疾病','无','1'),(40,'尿道结石','结石','肾疾病','无','1'),(41,'冠心病','冠心病','心脑血管疾病','无','1'),(44,'心肌梗塞','心梗','心脑血管疾病','无','1');
/*!40000 ALTER TABLE `intervention_template` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `intervention_template_food`
--

DROP TABLE IF EXISTS `intervention_template_food`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `intervention_template_food` (
  `template_id` int DEFAULT NULL,
  `food_id` int DEFAULT NULL,
  KEY `template_id` (`template_id`) USING BTREE,
  KEY `food_id` (`food_id`) USING BTREE,
  CONSTRAINT `intervention_template_food_ibfk_1` FOREIGN KEY (`template_id`) REFERENCES `intervention_template` (`templateid`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `intervention_template_food_ibfk_2` FOREIGN KEY (`food_id`) REFERENCES `t_foodbase` (`foodid`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `intervention_template_food`
--

LOCK TABLES `intervention_template_food` WRITE;
/*!40000 ALTER TABLE `intervention_template_food` DISABLE KEYS */;
INSERT INTO `intervention_template_food` VALUES (29,9),(29,10),(29,11),(41,6),(7,8),(7,1),(7,2),(7,3),(7,4),(9,3),(9,5),(9,4),(9,1),(9,2),(10,2),(10,1),(10,3),(10,4);
/*!40000 ALTER TABLE `intervention_template_food` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `intervention_template_sport`
--

DROP TABLE IF EXISTS `intervention_template_sport`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `intervention_template_sport` (
  `template_id` int DEFAULT NULL,
  `sport_id` int DEFAULT NULL,
  KEY `template_id` (`template_id`) USING BTREE,
  KEY `sport_id` (`sport_id`) USING BTREE,
  CONSTRAINT `intervention_template_sport_ibfk_1` FOREIGN KEY (`template_id`) REFERENCES `intervention_template` (`templateid`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `intervention_template_sport_ibfk_2` FOREIGN KEY (`sport_id`) REFERENCES `t_sportbase` (`sportid`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `intervention_template_sport`
--

LOCK TABLES `intervention_template_sport` WRITE;
/*!40000 ALTER TABLE `intervention_template_sport` DISABLE KEYS */;
INSERT INTO `intervention_template_sport` VALUES (7,6),(7,7),(7,1),(7,2),(7,3),(7,4),(9,1),(9,2),(9,3),(9,4),(9,5),(10,1),(10,2),(10,3),(10,4);
/*!40000 ALTER TABLE `intervention_template_sport` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_checkgroup`
--

DROP TABLE IF EXISTS `t_checkgroup`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_checkgroup` (
  `id` int NOT NULL AUTO_INCREMENT,
  `code` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `name` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `helpCode` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `sex` char(1) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `remark` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `attention` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT COMMENT='�������';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_checkgroup`
--

LOCK TABLES `t_checkgroup` WRITE;
/*!40000 ALTER TABLE `t_checkgroup` DISABLE KEYS */;
INSERT INTO `t_checkgroup` VALUES (5,'0001','一般检查','YBJC','0','一般检查','无'),(6,'0002','视力色觉','SLSJ','0','视力色觉',NULL),(7,'0003','血常规','XCG','0','血常规',NULL),(8,'0004','尿常规','NCG','0','尿常规',NULL),(9,'0005','肝功二项','GGEX','0','肝功二项',NULL),(10,'0006','甲肝三项','JGSX','0','甲肝三项',NULL),(11,'0007','乙肝五项','YGWX','0','乙肝五项',NULL),(12,'0008','肺功能','FGN','0','肺功能',NULL),(13,'0009','耳鼻喉六项','EBHLX','0','耳鼻喉六项',NULL),(14,'0010','微量元素检测','WLYSJC','2','微量元素检测',NULL),(15,'0011','口腔检查','KQJC','0','口腔检查',NULL),(16,'0012','生长发育测评','SZFYCP','0','生长发育测评',NULL),(17,'013','铁蛋白测定','TDBCD','0','铁蛋白测定',NULL),(18,'0014','全血铅测定','QXQCD','0','全血铅测定',NULL);
/*!40000 ALTER TABLE `t_checkgroup` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_checkgroup_checkitem`
--

DROP TABLE IF EXISTS `t_checkgroup_checkitem`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_checkgroup_checkitem` (
  `checkgroup_id` int NOT NULL DEFAULT '0',
  `checkitem_id` int NOT NULL DEFAULT '0',
  PRIMARY KEY (`checkgroup_id`,`checkitem_id`) USING BTREE,
  KEY `FK_Reference_5` (`checkitem_id`) USING BTREE,
  CONSTRAINT `FK_Reference_5` FOREIGN KEY (`checkitem_id`) REFERENCES `t_checkitem` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `group_id` FOREIGN KEY (`checkgroup_id`) REFERENCES `t_checkgroup` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_checkgroup_checkitem`
--

LOCK TABLES `t_checkgroup_checkitem` WRITE;
/*!40000 ALTER TABLE `t_checkgroup_checkitem` DISABLE KEYS */;
INSERT INTO `t_checkgroup_checkitem` VALUES (5,1),(5,2),(5,3),(5,4),(5,5),(6,6),(6,7),(6,8),(6,9),(6,10),(6,11),(6,12),(6,13),(6,14),(6,15),(6,16),(6,17),(6,18),(7,19),(7,20),(7,21),(7,22),(7,23),(7,24),(7,25),(7,26),(7,27),(7,28),(7,29),(8,35),(8,36),(8,37),(8,38),(8,39),(8,40),(8,41),(8,42),(8,43),(9,44),(9,45),(10,46),(10,47),(10,48),(11,49),(11,50),(11,51),(11,52),(11,53),(12,54),(13,55),(13,56),(13,57),(13,58),(13,59),(13,60),(15,61),(14,62),(17,63),(18,64),(14,65),(16,67),(16,68),(16,69);
/*!40000 ALTER TABLE `t_checkgroup_checkitem` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_checkitem`
--

DROP TABLE IF EXISTS `t_checkitem`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_checkitem` (
  `id` int NOT NULL AUTO_INCREMENT,
  `code` varchar(16) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `name` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `sex` char(1) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `age` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `price` float DEFAULT NULL,
  `type` char(1) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL COMMENT '���������,��Ϊ���ͼ�������',
  `attention` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `remark` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=107 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT COMMENT='�������';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_checkitem`
--

LOCK TABLES `t_checkitem` WRITE;
/*!40000 ALTER TABLE `t_checkitem` DISABLE KEYS */;
INSERT INTO `t_checkitem` VALUES (1,'0001','身高','0','0-6',5,'1','无','了解身高是否正常,是否过高或过矮，为相关科室诊断提供依据'),(2,'0002','体重','0','0-6',5,'1','无','了解体重是否正常，有无体重不足，超重或肥胖，为相关科室诊断提供依据'),(3,'0003','体重指数(IBM)','0','0-6',5,'1','无','了解体重是否正常，有无体重不足，超重或肥胖，为相关科室诊断提供依据'),(4,'0004','收缩压','0','0-6',5,'1','无','了解体重是否正常，有无体重不足，超重或肥胖，为相关科室诊断提供依据'),(5,'0005','舒张压','0','0-6',5,'1','无','了解体重是否正常，有无体重不足，超重或肥胖，为相关科室诊断提供依据'),(6,'0006','裸视力（右）','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(7,'0007','裸视力（左）','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(8,'0008','矫正视力（右）','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(9,'0009','矫正视力（左）','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(10,'0010','色觉','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(11,'0011','眼睑','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(12,'0012','结膜','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(13,'0013','巩膜','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(14,'0014','角膜','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(15,'0015','瞳孔','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(16,'0016','晶状体','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(17,'0017','玻璃体','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(18,'0018','眼底','0','0-6',5,'1','无','进行视力、辨色力测验，筛查常见眼部疾病：结膜炎角膜炎，屈光不正等'),(19,'0019','白细胞计数','0','0-6',10,'2','无','通过检测血液细胞的计数计不同种类细胞、成分的分类来反应身体状况，如：贫血、感染等等'),(20,'0020','红细胞计数','0','0-6',10,'2',NULL,'通过检测血液细胞的计数计不同种类细胞、成分的分类来反应身体状况，如：贫血、感染等等'),(21,'0021','血红蛋白','0','0-6',10,'2',NULL,'通过检测血液细胞的计数计不同种类细胞、成分的分类来反应身体状况，如：贫血、感染等等'),(22,'0021','红细胞压积','0','0-6',10,'2',NULL,'通过检测血液细胞的计数计不同种类细胞、成分的分类来反应身体状况，如：贫血、感染等等'),(23,'0022','平均红细胞体积','0','0-6',10,'2',NULL,'通过检测血液细胞的计数计不同种类细胞、成分的分类来反应身体状况，如：贫血、感染等等'),(24,'0023','平均红细胞血红蛋白含量','0','0-6',10,'2',NULL,'通过检测血液细胞的计数计不同种类细胞、成分的分类来反应身体状况，如：贫血、感染等等'),(25,'0024','平均红细胞血红蛋白浓度','0','0-6',10,'2',NULL,'通过检测血液细胞的计数计不同种类细胞、成分的分类来反应身体状况，如：贫血、感染等等'),(26,'0025','红细胞分布宽度-变异系数','0','0-6',10,'2',NULL,'通过检测血液细胞的计数计不同种类细胞、成分的分类来反应身体状况，如：贫血、感染等等'),(27,'0026','血小板计数','0','0-6',10,'2',NULL,'通过检测血液细胞的计数计不同种类细胞、成分的分类来反应身体状况，如：贫血、感染等等'),(28,'0027','平均血小板体积','0','0-6',10,'2',NULL,'通过检测血液细胞的计数计不同种类细胞、成分的分类来反应身体状况，如：贫血、感染等等'),(29,'0028','血小板分布宽度','0','0-6',10,'2',NULL,'通过检测血液细胞的计数计不同种类细胞、成分的分类来反应身体状况，如：贫血、感染等等'),(30,'0030','浅表淋巴结','0','0-6',10,'2',NULL,'淋巴结有无肿大、甲状腺、乳房、四肢脊柱有无异常等'),(31,'0031','甲状腺','0','0-6',10,'2',NULL,'淋巴结有无肿大、甲状腺、乳房、四肢脊柱有无异常等'),(32,'0032','脊柱','0','0-6',10,'2',NULL,'淋巴结有无肿大、甲状腺、乳房、四肢脊柱有无异常等'),(33,'0033','四肢','0','0-6',10,'2',NULL,'淋巴结有无肿大、甲状腺、乳房、四肢脊柱有无异常等'),(34,'0034','皮肤','0','0-6',10,'2',NULL,'淋巴结有无肿大、甲状腺、乳房、四肢脊柱有无异常等'),(35,'0035','尿素','0','0-6',10,'2',NULL,'通过尿液相关重要指标，检测是否有尿路感染或者相关疾病'),(36,'0036','尿酸碱度','0','0-6',10,'2',NULL,'通过尿液相关重要指标，检测是否有尿路感染或者相关疾病'),(37,'0037','尿白细胞','0','0-6',10,'2',NULL,'通过尿液相关重要指标，检测是否有尿路感染或者相关疾病'),(38,'0038','尿酸','0','0-6',10,'2',NULL,'通过尿液相关重要指标，检测是否有尿路感染或者相关疾病'),(39,'0039','尿蛋白质','0','0-6',10,'2',NULL,'通过尿液相关重要指标，检测是否有尿路感染或者相关疾病'),(40,'0040','尿糖','0','0-6',10,'2',NULL,'通过尿液相关重要指标，检测是否有尿路感染或者相关疾病'),(41,'0041','尿酮体','0','0-6',10,'2',NULL,'通过尿液相关重要指标，检测是否有尿路感染或者相关疾病'),(42,'0042','尿胆原','0','0-6',10,'2',NULL,'通过尿液相关重要指标，检测是否有尿路感染或者相关疾病'),(43,'0043','尿胆红素','0','0-6',10,'2',NULL,'通过尿液相关重要指标，检测是否有尿路感染或者相关疾病'),(44,'0044','丙氨酸氨基转移酶（ALT）','0','0-6',10,'2',NULL,'是肝细胞受损周灵敏的指标，升高可提示肝胆系统疾病如急性传染性肝炎、中毒性肝炎、药物中毒性肝炎'),(45,'0045','天门冬氨酸氨基转移酶（AST）','0','0-6',10,'2',NULL,'是肝细胞受损周灵敏的指标，升高可提示肝胆系统疾病如急性传染性肝炎、中毒性肝炎、药物中毒性肝炎'),(46,'0046','甲型肝炎病毒抗体二项','0','0-6',10,'2',NULL,'用在甲型肝炎的早期诊断和鉴别诊断'),(47,'0047','免疫球蛋白M（IgM）','0','0-6',10,'2',NULL,'用在甲型肝炎的早期诊断和鉴别诊断'),(48,'0048','免疫球蛋白G（IgG）','0','0-6',10,'2',NULL,'用在甲型肝炎的早期诊断和鉴别诊断'),(49,'0049','乙肝表面抗原（HBsAg）','0','0-6',10,'2',NULL,'用在甲型肝炎的早期诊断和鉴别诊断'),(50,'0050','乙肝表面抗体（HBsAb）','0','0-6',10,'2',NULL,'用在甲型肝炎的早期诊断和鉴别诊断'),(51,'0051','乙肝表面e抗原（HBeAg）','0','0-6',10,'2',NULL,'用在甲型肝炎的早期诊断和鉴别诊断'),(52,'0052','乙肝e抗体（HBeAb）','0','0-6',10,'2',NULL,'用在甲型肝炎的早期诊断和鉴别诊断'),(53,'0053','乙肝核心抗体（HBcAb）','0','0-6',10,'2',NULL,'用在甲型肝炎的早期诊断和鉴别诊断'),(54,'0054','肺功能','0','0-6',10,'2',NULL,'对呼吸生理功能的基本状况做出质和量的评价，明确肺功能障碍的程度和类型'),(55,'0055','外耳','0','0-6',10,'2',NULL,'检测耳、鼻、喉各部形态，功能是否正常，进行发音，听力测试等筛查常见的炎症及肿瘤。'),(56,'0056','外耳道','0','0-6',10,'2',NULL,'检测耳、鼻、喉各部形态，功能是否正常，进行发音，听力测试等筛查常见的炎症及肿瘤。'),(57,'0057','鼓膜','0','0-6',10,'2',NULL,'检测耳、鼻、喉各部形态，功能是否正常，进行发音，听力测试等筛查常见的炎症及肿瘤。'),(58,'0058','鼻窦','0','0-6',10,'2',NULL,'检测耳、鼻、喉各部形态，功能是否正常，进行发音，听力测试等筛查常见的炎症及肿瘤。'),(59,'0059','鼻腔','0','0-6',10,'2',NULL,'检测耳、鼻、喉各部形态，功能是否正常，进行发音，听力测试等筛查常见的炎症及肿瘤。'),(60,'0060','鼻中隔','0','0-6',10,'2',NULL,'检测耳、鼻、喉各部形态，功能是否正常，进行发音，听力测试等筛查常见的炎症及肿瘤。'),(61,'0061','口腔检查','0','0-6',10,'2',NULL,'通过检查可对牙龈炎、牙周炎、龋齿进行早期检查，提供口腔保健指导'),(62,'0062','微量元素检测','0','0-6',10,'2',NULL,'检测锌铁铜钙镁铅在体能水平，观察近期影响情况'),(63,'0063','铁蛋白测定','0','0-6',10,'2',NULL,'隐形贫血的测定，是铁缺乏的敏感指标'),(64,'0064','全血铅测定','0','0-6',10,'2',NULL,'判定有无铅中毒，高铅血症、血铅高影响儿童钙铁锌的吸收，影响生长发育'),(65,'0065','25羟基维生素D3测定','0','0-6',10,'2',NULL,'测试维生素D有无缺乏'),(66,'0066','骨密度测定','0','0-6',10,'2',NULL,'评估儿童骨矿物质含量及钙营养状况'),(67,'0067','运动体质测试','0','0-6',10,'2',NULL,'测试儿童运动体质状况'),(68,'0068','营养评估','0','0-6',10,'2',NULL,'针对儿童消瘦、肥胖、偏食等给予合理的营养运动指导'),(69,'0069','儿童发育量表','0','0-6',10,'2',NULL,'全面衡量大脑发育水平、涉及认知、运动、情感、语言、社会适应能力等多方面');
/*!40000 ALTER TABLE `t_checkitem` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_constitution`
--

DROP TABLE IF EXISTS `t_constitution`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_constitution` (
  `id` int NOT NULL AUTO_INCREMENT,
  `number` varchar(16) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `chooseone` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosetwo` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosethree` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosefour` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosefive` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosesix` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `chooseseven` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `chooseeight` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_constitution`
--

LOCK TABLES `t_constitution` WRITE;
/*!40000 ALTER TABLE `t_constitution` DISABLE KEYS */;
INSERT INTO `t_constitution` VALUES (1,'1001','李明','没有','没有','没有','没有','没有','没有','没有','没有','2021-05-24 11:16:22'),(2,'1001','李华','没有','没有','没有','没有','没有','没有','没有','没有','2021-05-22 13:22:32'),(3,'111',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2021-05-22 12:22:22'),(4,'1001','李华','没有','没有','没有','没有','没有','没有','没有','没有','2021-05-24 10:51:22'),(5,'1001','李华','没有','没有','没有','没有','没有','没有','没有','没有','2021-05-24 09:53:22'),(6,'1001','李华','没有','没有','没有','没有','没有','没有','没有','没有','2021-05-22 16:22:22'),(7,'1021','李华','没有','没有','没有','没有','没有','没有','没有','没有','2021-05-24 15:51:22'),(8,'1022','李华','没有','没有','没有','没有','没有','没有','没有','没有',NULL),(9,'1023','李华','没有','没有','没有','没有','没有','没有','没有','没有',NULL),(10,'1023','李华','没有','没有','没有','没有','没有','没有','没有','没有','2021-05-24 16:51:32'),(11,'10042','侯睿宏','170~180','60~80','6~10','3min~4min','6~10','1.5m~2m','7s~8s','170~200','2021-05-27 00:00:00');
/*!40000 ALTER TABLE `t_constitution` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_diseasebase`
--

DROP TABLE IF EXISTS `t_diseasebase`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_diseasebase` (
  `diseaseid` int NOT NULL AUTO_INCREMENT,
  `number` varchar(16) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `diseasename` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `diseasetype` varchar(16) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `diseasestate` longtext CHARACTER SET utf8mb3 COLLATE utf8_general_ci,
  PRIMARY KEY (`diseaseid`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_diseasebase`
--

LOCK TABLES `t_diseasebase` WRITE;
/*!40000 ALTER TABLE `t_diseasebase` DISABLE KEYS */;
INSERT INTO `t_diseasebase` VALUES (1,'k1','感冒','呼吸系统疾病','可分为普通感冒和流行性感冒。普通感冒俗称”伤风“、“上感“，是由普通病毒如鼻病毒或一般的细菌如链球菌引起的上呼吸道黏膜发炎所致的疾病，30%—50%是由某种血清型的鼻病毒引起。流行性感冒是由流感病毒引起的急性呼吸道传染病，由A、B、C三型流行性病毒引起。本病传染性强，通过空气飞沫传播。症状：普通感冒的主要症状鼻粘膜充血，打喷嚏，流鼻涕，鼻塞，有的咽喉充血疼痛，声音嘶哑。继续发展会出现咽部发痒，咳嗽，急性支气管炎，早期病人一般不发烧全身症状不明显。流感的突出症状是发病急，全身症状较重，高烧，肌肉疼痛，全身各关节酸痛、乏力，有的会出现咳嗽，但多为干咳无痰。常用处方氨咖黄那敏胶囊 或七佛山/复方氨酚烷胺片抗病毒口服液或双黄连胶囊药芝林/VC银翘片\r\n小柴胡颗粒或对乙酰氨基酚药芝林/罗红霉素分散片健康提示：1、要多喝水，注意休息。\r\n2、饮食应以清淡为主，多吃一些新鲜的蔬菜和水果。3、室内要经常通风，使空气清新，室内的温度要适宜。'),(2,'G1','高血压','心脑血管疾病','高血压是以体循环动脉压增高为主要表现的临床综合征，可分为原发性(原因不明95%)和继发性(某种疾病的一种临床表现，有明确而独立的病因5%)两大类。长期高血压本身引起症状(血压升高所致)，本身又是多种心、脑血管疾病的危险因素，引起心、脑、肾、血管等靶器官损害、功能衰竭。病因:具体发病原因目前尚未明确，主要有遗传因素，环境因素(饮食、精神应激)，其他因素(体重、避孕药、OSAS)等。\r\n病症:起病缓慢，早期常无症状。部分患者可有头痛、头晕、疲劳、心悸、耳鸣等症状。并发症:高血压危象、高血压脑病、心脏疾病、脑血管病、慢性肾功能衰竭、主动脉夹层等。常用处方:尼群地平片，美托洛尔，圣鹰/银杏叶片，药芝林/大豆卵磷脂软胶囊，药芝林/深海鱼油软胶囊健康提示:1、限制盐的摄入。2、饮食宜清淡，多食新鲜蔬菜、水果，适当多吃些鱼类和豆制品，避免高脂肪饮食。3、绝对戒烟，避免过多饮酒。4、有规律的适度体育活动，肥胖者应减轻体重。5、保持精神放松，心情愉快'),(3,'h1','儿童缺钙','儿科疾病','病因: 1、 维生素D合成障碍导致的肠道钙吸收障碍;另外是受疾病的影响，如腹泻、肝炎、胃炎、频繁呕吐等，致使钙吸收不良或钙大量流失。2、饮食搭配不合理，含钙食品摄入过少。3、 不喜欢晒太阳，缺乏运动。4、儿童骨骼生长迅速，体内钙的需求量增加。病症:盜汗(易形成枕秃)、精神烦躁、夜惊、囟门晚闭、出牙和换牙延迟、方颅、鸡胸，严重者可出现驼背、“X\"形腿、“O\"形腿等常用处方:宝宝乐/小儿健脾颗粒鲁抗/锌钙特口服液药芝林/儿童鱼油健康提示:1、改善偏食挑食的习惯，多吃新鲜蔬菜、水果;多吃含钙高的食物。2、加强运动，父母多带孩子进行户外亲子运动。骨质增生病因:运动和劳动多，关节磨损重，使关节产生退行性骨变。此病多见于中老年人，女性发病高于男性\r\n病症:侧或双侧关节不适，疼痛肿胀。起初疼痛多在长时间行走或上下楼梯时，但休息或卧床后好转。随着病情发展，走平路也疼痛，活动不方便，关节不稳定，走路稍不注意就会疼痛;同时膝关节活动时有像捻头发时所发出的响声。重者膝关节还会突然“锁\"在某一位置 上，解\"锁”时，伴有明显的弹响\r\n常用处方:圣方/骨筋丸胶囊\r\n汉磁/骨质增生贴\r\n药芝林/B族维生素软胶囊(有利于营养素的均衡全面消化吸收，并有利于骨骼吸收和补充钙)\r\n健康提示:\r\n1、保持活跃的生活方式及定期做运动。\r\n2、保持均衡饮食，以确保摄取足够的钙质及维生素\r\n3、戒烟，减少或避免饮酒。\r\n4、如有明确发病原因者，首先应积极治疗原发病。\r\n'),(4,'a4','消化性溃疡','消化系统疾病','概念:发生于胃和十二指肠球部的慢性溃疡，其形成与胃酸、胃蛋白酶的消化作用有密切关系。好发部位:胃及十二指肠病理特点:粘膜的慢性溃疡\r\n临床表现:慢性反复发作的上腹部疼痛溃疡部位:胃溃疡:多发于胃小弯及幽门部\r\n后壁多于前壁大弯及胃底部罕见十二指肠溃疡:球部最多、球后少见前壁>小弯>后壁>大弯发病情况:全世界常见病，总发病率占人口的10-12%，近年来呈上升趋势。年龄: 20-50岁 为高发年龄，<10、 >60岁较少见性别:男:女=3.9- 8.5:1部位:十二指肠: 胃= 1.15-4.29:1病因:多种因素共同作用的结果，包括攻击因子-防御因子失衡、Hp感染、遗传因素、饮食因素、胃肠动力障碍等。临床表现:上腹部疼痛特点:慢性、节律性、周期性部位:胃溃疡、球部溃疡、球后溃疡\r\n性质：灼痛、胀痛、隐痛、饥饿痛等，大多可忍受\r\n其他症状:出血，反酸、流涎，恶心、呕吐，嗳腹胀、腹泻\r\n全身症状:消瘦、失眠等。\r\n诊断依据:\r\n典型病史:慢性、节律性、周期性上腹部隐痛，局部压痛等。确诊: X线钡餐及内镜检查。\r\n常用处方:瑞奥/奥美拉唑肠溶片\r\n药芝林/阿莫西林胶囊\r\n克顿宁/克拉霉素分散片\r\n或三九/阿莫西林克拉维酸钾片\r\n枸橼酸铋钾(丽珠得乐)等\r\n健康提示: 1、 建立良好的生活饮食习惯。\r\n2、避免吸烟、饮酒。\r\n3、注意劳逸结合，保持乐观的情绪。\r\n4、慎用非甾体类抗炎药\r\n'),(5,'c4','骨质增生','骨科疾病','骨质增生是在中老年人中常见的症状，常见的有颈椎，腰椎，膝关节骨质增生，最主要的症状就是疼痛，麻木，肿胀，僵硬，特别是到了中老年阶段都要及时补钙，预防骨质增生的发生。'),(6,'e5','骨质疏松','骨科疾病','以骨量低下、骨微结构损坏，骨脆性增加，易发生骨折为特征的全身性骨病主要表现为腰背疼痛、脊柱变形、骨折等病因为遗传、内分泌、营养因素、药物以及年龄增长等多种因素主要治疗方法为生活方式调理和药物治疗，严重者可使用手术治疗'),(7,'pp3','手足藓','皮肤科疾病','概述：手足癣是发生于掌、跖及指、趾间皮肤的浅部真菌感染性疾病，致病菌主要为皮肤癣菌。根据其发病部位可区分为足癣及手癣，足癣的患病率较手癣高。临床症状皮疹表现为红斑、鳞屑、浸渍、糜烂、结痂、水疱、丘疹等，病程延长后出现角化、皲裂。危害不但会对手足部位造成损害，还会影响患者身心健康。并发症甲癣、体癣、丹毒、蜂窝织炎、淋巴管炎、淋巴结炎、癣菌疹等。'),(8,'gg4','急性盆腔炎','妇科疾病','急性的盆腔炎是指以前没有过盆腔炎这种现象，突然间出现肚子疼痛、下坠、腰酸、腰痛这一类现象的发生。在做B超检查的时候会检测到有输卵管增粗或者是有子宫内膜炎症，起病比较急，而且还会比较严重，有人甚至出现体温增高、发烧的现象。这就需要及时的针对病因进行治疗，可以用抗厌氧菌的药物甲硝唑或者替硝唑进行治疗，控制病情的发展。有急性的盆腔炎，首先应该确定病因，然后根据个人的病情做出准确的判断。如果病情特别严重的需要，通过静脉输液治疗；病情不是特别严重，可以通过口服药物控制病情。');
/*!40000 ALTER TABLE `t_diseasebase` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_foodbase`
--

DROP TABLE IF EXISTS `t_foodbase`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_foodbase` (
  `foodid` int NOT NULL AUTO_INCREMENT,
  `foodcode` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `foodname` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `foodtype` varchar(16) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `foodremark` varchar(256) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  PRIMARY KEY (`foodid`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=675 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_foodbase`
--

LOCK TABLES `t_foodbase` WRITE;
/*!40000 ALTER TABLE `t_foodbase` DISABLE KEYS */;
INSERT INTO `t_foodbase` VALUES (1,'挂面','挂面','面食','无'),(2,'面条','面条','面食','无'),(3,'txm','通心面','面食','无'),(4,'龙须面','龙须面','面食','无'),(5,'花卷','花卷','面食','无'),(6,'空锅饼','空锅饼','面食','无'),(7,'烙饼','烙饼','面食','无'),(8,'馒头','馒头','面食','无'),(9,'烧饼','烧饼','面食','无'),(10,'油饼','油饼','面食','无'),(11,'油条','油条','面食','无'),(12,'水面筋','水面筋','面食','无'),(13,'油面筋','油面筋','面食','无'),(14,'面筋','面筋','面食','无'),(15,'米饭','米饭','面食','无'),(16,'粳米粥','粳米粥','面食','无'),(17,'籼米粉','籼米粉','面食','无'),(18,'籼米粥','籼米粥','面食','无'),(19,'米粉','米粉','面食','无'),(20,'河粉','河粉','面食','无'),(21,'玉米','玉米','面食','无'),(22,'玉米面','玉米面','面食','无'),(23,'小米面','小米面','面食','无'),(24,'小米粥','小米粥','面食','无'),(25,'莜麦面','莜麦面','面食','无'),(26,'薏米面','薏米面','面食','无'),(27,'荞麦面','荞麦面','面食','无'),(28,'高粱面条','高粱面条','面食','无'),(29,'马铃薯','马铃薯','面食','无'),(30,'甘薯','甘薯','面食','无'),(31,'甘薯片','甘薯片','面食','无'),(32,'木薯','木薯','面食','无'),(33,'藕粉','藕粉','面食','无'),(34,'桂花藕粉','桂花藕粉','面食','无'),(35,'魔芋精粉','魔芋精粉','面食','无'),(36,'粉丝','粉丝','面食','无'),(37,'豌豆粉丝','豌豆粉丝','面食','无'),(38,'粉条','粉条','面食','无'),(39,'绿豆面','绿豆面','面食','无'),(40,'绿豆饼','绿豆饼','面食','无'),(41,'小豆粥','小豆粥','面食','无'),(42,'芸豆','芸豆','面食','无'),(43,'蚕豆','蚕豆','面食','无'),(44,'马牙蚕豆','马牙蚕豆','面食','无'),(45,'扁豆','扁豆','面食','无'),(46,'眉豆','眉豆','面食','无'),(47,'豌豆','豌豆','面食','无'),(48,'木豆','木豆','面食','无'),(49,'艾窝窝','艾窝窝','面食','无'),(50,'茶汤','茶汤','面食','无'),(51,'炒肝','炒肝','面食','无'),(52,'春卷','春卷','面食','无'),(53,'豆腐脑','豆腐脑','面食','无'),(54,'粉皮','粉皮','面食','无'),(55,'灌肠','灌肠','面食','无'),(56,'煎饼','煎饼','面食','无'),(57,'焦圈','焦圈','面食','无'),(58,'京八件','京八件','面食','无'),(59,'凉粉','凉粉','面食','无'),(60,'凉面','凉面','面食','无'),(61,'龙虾片','龙虾片','面食','无'),(62,'驴打滚','驴打滚','面食','无'),(63,'香酥卷','香酥卷','面食','无'),(64,'面窝','面窝','面食','无'),(65,'年糕','年糕','面食','无'),(66,'青稞炒面','青稞炒面','面食','无'),(67,'热干面','热干面','面食','无'),(68,'三鲜豆皮','三鲜豆皮','面食','无'),(69,'豌豆黄','豌豆黄','面食','无'),(70,'香油炒面','香油炒面','面食','无'),(71,'油茶','油茶','面食','无'),(72,'油炸豆瓣','油炸豆瓣','面食','无'),(73,'油炸豆花','油炸豆花','面食','无'),(74,'炸糕','炸糕','面食','无'),(75,'黑芝麻汤圆','黑芝麻汤圆','面食','无'),(76,'酒酿','酒酿','面食','无'),(77,'过桥米线','过桥米线','面食','无'),(78,'板油酥饼','板油酥饼','面食','无'),(79,'黄豆','黄豆','面食','无'),(80,'黑豆','黑豆','面食','无'),(81,'青豆','青豆','面食','无'),(82,'豆腐花','豆腐花','面食','无'),(83,'豆腐','豆腐','面食','无'),(84,'豆腐丝','豆腐丝','面食','无'),(85,'豆腐卷','豆腐卷','面食','无'),(86,'豆腐皮','豆腐皮','面食','无'),(87,'油豆腐','油豆腐','面食','无'),(88,'腐竹','腐竹','面食','无'),(89,'千张','千张','面食','无'),(90,'豆腐干','豆腐干','面食','无'),(91,'素大肠','素大肠','面食','无'),(92,'素火腿','素火腿','面食','无'),(93,'素鸡','素鸡','面食','无'),(94,'素鸡丝卷','素鸡丝卷','面食','无'),(95,'素什锦','素什锦','面食','无'),(96,'炸素虾','炸素虾','面食','无'),(97,'烤麸','烤麸','面食','无'),(98,'白萝卜','白萝卜','面食','无'),(99,'红皮萝卜','红皮萝卜','面食','无'),(100,'红旦旦萝卜','红旦旦萝卜','面食','无'),(101,'红萝卜','红萝卜','面食','无'),(102,'红心萝卜','红心萝卜','面食','无'),(103,'花叶萝卜','花叶萝卜','面食','无'),(104,'青萝卜','青萝卜','面食','无'),(105,'水萝卜','水萝卜','面食','无'),(106,'樱桃萝卜','樱桃萝卜','面食','无'),(107,'胡萝卜','胡萝卜','面食','无'),(108,'芥菜头','芥菜头','面食','无'),(109,'甜菜根','甜菜根','面食','无'),(110,'刀豆','刀豆','面食','无'),(111,'豆角','豆角','面食','无'),(112,'荷兰豆','荷兰豆','面食','无'),(113,'龙牙豆','龙牙豆','面食','无'),(114,'毛豆','毛豆','面食','无'),(115,'四季豆','四季豆','面食','无'),(116,'豌豆尖','豌豆尖','面食','无'),(117,'豇豆','豇豆','面食','无'),(118,'发芽豆','发芽豆','面食','无'),(119,'黄豆芽','黄豆芽','面食','无'),(120,'绿豆芽','绿豆芽','面食','无'),(121,'豌豆苗','豌豆苗','面食','无'),(122,'黑豆苗','黑豆苗','面食','无'),(123,'茄子','茄子','面食','无'),(124,'番茄','番茄','面食','无'),(125,'辣椒','辣椒','面食','无'),(126,'甜椒','甜椒','面食','无'),(127,'秋葵','秋葵','面食','无'),(128,'樱桃番茄','樱桃番茄','面食','无'),(129,'彩椒','彩椒','面食','无'),(130,'白瓜','白瓜','面食','无'),(131,'菜瓜','菜瓜','面食','无'),(132,'冬瓜','冬瓜','面食','无'),(133,'佛手瓜','佛手瓜','面食','无'),(134,'葫芦','葫芦','面食','无'),(135,'葫芦条（干）','葫芦条（干）','面食','无'),(136,'黄瓜','黄瓜','面食','无'),(137,'金瓜','金瓜','面食','无'),(138,'苦瓜','苦瓜','面食','无'),(139,'南瓜','南瓜','面食','无'),(140,'丝瓜','丝瓜','面食','无'),(141,'西葫芦','西葫芦','面食','无'),(142,'黄金西葫芦','黄金西葫芦','面食','无'),(143,'黄茎瓜','黄茎瓜','面食','无'),(144,'迷你黄瓜','迷你黄瓜','面食','无'),(145,'秋黄瓜','秋黄瓜','面食','无'),(146,'蒜黄','蒜黄','面食','无'),(147,'蒜苗','蒜苗','面食','无'),(148,'蒜苔','蒜苔','面食','无'),(149,'大葱','大葱','面食','无'),(150,'细香葱','细香葱','面食','无'),(151,'洋葱','洋葱','面食','无'),(152,'韭菜','韭菜','面食','无'),(153,'韭黄','韭黄','面食','无'),(154,'韭苔','韭苔','面食','无'),(155,'大白菜','大白菜','面食','无'),(156,'酸白菜','酸白菜','面食','无'),(157,'小白菜','小白菜','面食','无'),(158,'菜心','菜心','面食','无'),(159,'红菜心','红菜心','面食','无'),(160,'小青菜','小青菜','面食','无'),(161,'油菜心','油菜心','面食','无'),(162,'奶白菜','奶白菜','面食','无'),(163,'鸡毛菜','鸡毛菜','面食','无'),(164,'油菜','油菜','面食','无'),(165,'卷心菜','卷心菜','面食','无'),(166,'菜花','菜花','面食','无'),(167,'西兰花','西兰花','面食','无'),(168,'雪菜','雪菜','面食','无'),(169,'芥蓝','芥蓝','面食','无'),(170,'圆白菜','圆白菜','面食','无'),(171,'菠菜','菠菜','面食','无'),(172,'胡萝卜缨','胡萝卜缨','面食','无'),(173,'苦菜','苦菜','面食','无'),(174,'萝卜缨','萝卜缨','面食','无'),(175,'木耳菜','木耳菜','面食','无'),(176,'芹菜','芹菜','面食','无'),(177,'芹菜茎','芹菜茎','面食','无'),(178,'芹菜叶','芹菜叶','面食','无'),(179,'生菜','生菜','面食','无'),(180,'甜菜叶','甜菜叶','面食','无'),(181,'香菜','香菜','面食','无'),(182,'苋菜','苋菜','面食','无'),(183,'茼蒿','茼蒿','面食','无'),(184,'茴香','茴香','面食','无'),(185,'荠菜','荠菜','面食','无'),(186,'莴笋','莴笋','面食','无'),(187,'莴笋叶','莴笋叶','面食','无'),(188,'空心菜','空心菜','面食','无'),(189,'西芹','西芹','面食','无'),(190,'油麦菜','油麦菜','面食','无'),(191,'竹笋','竹笋','面食','无'),(192,'白笋（干）','白笋（干）','面食','无'),(193,'鞭笋','鞭笋','面食','无'),(194,'春笋','春笋','面食','无'),(195,'冬笋','冬笋','面食','无'),(196,'毛笋','毛笋','面食','无'),(197,'百合','百合','面食','无'),(198,'黄花菜','黄花菜','面食','无'),(199,'芦笋','芦笋','面食','无'),(200,'慈菇','慈菇','面食','无'),(201,'豆瓣菜','豆瓣菜','面食','无'),(202,'藕','藕','面食','无'),(203,'蒲菜','蒲菜','面食','无'),(204,'水芹菜','水芹菜','面食','无'),(205,'茭白','茭白','面食','无'),(206,'荸荠','荸荠','面食','无'),(207,'大薯','大薯','面食','无'),(208,'凉薯','凉薯','面食','无'),(209,'葛薯','葛薯','面食','无'),(210,'山药','山药','面食','无'),(211,'芋头','芋头','面食','无'),(212,'白薯叶','白薯叶','面食','无'),(213,'马兰头','马兰头','面食','无'),(214,'香椿','香椿','面食','无'),(215,'榆钱','榆钱','面食','无'),(216,'金花菜','金花菜','面食','无'),(217,'荞菜','荞菜','面食','无'),(218,'蕨菜（脱水）','蕨菜（脱水）','面食','无'),(219,'苦苣菜','苦苣菜','面食','无'),(220,'草菇','草菇','面食','无'),(221,'大红菇（干）','大红菇（干）','面食','无'),(222,'地衣（水浸）','地衣（水浸）','面食','无'),(223,'冬菇(干）','冬菇(干）','面食','无'),(224,'猴头菇','猴头菇','面食','无'),(225,'黄蘑（水发）','黄蘑（水发）','面食','无'),(226,'金针菇','金针菇','面食','无'),(227,'口蘑','口蘑','面食','无'),(228,'蘑菇（鲜）','蘑菇（鲜）','面食','无'),(229,'蘑菇（干）','蘑菇（干）','面食','无'),(230,'木耳（干）','木耳（干）','面食','无'),(231,'木耳（水发）','木耳（水发）','面食','无'),(232,'平菇','平菇','面食','无'),(233,'普中红蘑（干）','普中红蘑（干）','面食','无'),(234,'双孢蘑菇','双孢蘑菇','面食','无'),(235,'松蘑（干）','松蘑（干）','面食','无'),(236,'香菇（鲜）','香菇（鲜）','面食','无'),(237,'香菇(干）','香菇(干）','面食','无'),(238,'银耳（干）','银耳（干）','面食','无'),(239,'珍珠白蘑（干）','珍珠白蘑（干）','面食','无'),(240,'榛蘑（干）','榛蘑（干）','面食','无'),(241,'榛蘑（水发）','榛蘑（水发）','面食','无'),(242,'白蘑菇','白蘑菇','面食','无'),(243,'茶树菇（干）','茶树菇（干）','面食','无'),(244,'黄蘑（干）','黄蘑（干）','面食','无'),(245,'鸡腿菇（干）','鸡腿菇（干）','面食','无'),(246,'鸡枞菌','鸡枞菌','面食','无'),(247,'白牛肝菌','白牛肝菌','面食','无'),(248,'白牛肝菌(干）','白牛肝菌(干）','面食','无'),(249,'黑牛肝菌','黑牛肝菌','面食','无'),(250,'黄皮牛肝菌','黄皮牛肝菌','面食','无'),(251,'乳牛肝菌（干）','乳牛肝菌（干）','面食','无'),(252,'青头菌','青头菌','面食','无'),(253,'杏鲍菇','杏鲍菇','面食','无'),(254,'血红菇（干）','血红菇（干）','面食','无'),(255,'元蘑（干）','元蘑（干）','面食','无'),(256,'竹荪（干）','竹荪（干）','面食','无'),(257,'发菜（干）','发菜（干）','面食','无'),(258,'海带','海带','面食','无'),(259,'海带（干）','海带（干）','面食','无'),(260,'海带（浸）','海带（浸）','面食','无'),(261,'海冻菜','海冻菜','面食','无'),(262,'苔菜（干）','苔菜（干）','面食','无'),(263,'紫菜（干）','紫菜（干）','面食','无'),(264,'螺旋藻（干）','螺旋藻（干）','面食','无'),(265,'裙带菜（干）','裙带菜（干）','面食','无'),(266,'苹果','苹果','面食','无'),(267,'红富士苹果','红富士苹果','面食','无'),(268,'秋里蒙苹果','秋里蒙苹果','面食','无'),(269,'香玉苹果','香玉苹果','面食','无'),(270,'梨','梨','面食','无'),(271,'巴梨','巴梨','面食','无'),(272,'库尔勒梨','库尔勒梨','面食','无'),(273,'莱阳梨','莱阳梨','面食','无'),(274,'马蹄黄梨','马蹄黄梨','面食','无'),(275,'明月梨','明月梨','面食','无'),(276,'木梨','木梨','面食','无'),(277,'苹果梨','苹果梨','面食','无'),(278,'软梨','软梨','面食','无'),(279,'苏梅梨','苏梅梨','面食','无'),(280,'苏木梨','苏木梨','面食','无'),(281,'酥梨','酥梨','面食','无'),(282,'酸梨','酸梨','面食','无'),(283,'香梨','香梨','面食','无'),(284,'雪花梨','雪花梨','面食','无'),(285,'雪梨','雪梨','面食','无'),(286,'鸭广梨','鸭广梨','面食','无'),(287,'鸭梨','鸭梨','面食','无'),(288,'鳄梨','鳄梨','面食','无'),(289,'大山楂','大山楂','面食','无'),(290,'红果（干）','红果（干）','面食','无'),(291,'海棠果','海棠果','面食','无'),(292,'沙果','沙果','面食','无'),(293,'蛇果','蛇果','面食','无'),(294,'桃','桃','面食','无'),(295,'白粉桃','白粉桃','面食','无'),(296,'黄桃','黄桃','面食','无'),(297,'金红桃','金红桃','面食','无'),(298,'水蜜桃','水蜜桃','面食','无'),(299,'蜜桃','蜜桃','面食','无'),(300,'李子','李子','面食','无'),(301,'李子杏','李子杏','面食','无'),(302,'梅','梅','面食','无'),(303,'杏','杏','面食','无'),(304,'杏干','杏干','面食','无'),(305,'黑李子','黑李子','面食','无'),(306,'西梅','西梅','面食','无'),(307,'枣（鲜）','枣（鲜）','面食','无'),(308,'枣（干）','枣（干）','面食','无'),(309,'金丝小枣','金丝小枣','面食','无'),(310,'乐陵枣','乐陵枣','面食','无'),(311,'黑枣','黑枣','面食','无'),(312,'酒枣','酒枣','面食','无'),(313,'蜜枣','蜜枣','面食','无'),(314,'冬枣','冬枣','面食','无'),(315,'小枣（干）','小枣（干）','面食','无'),(316,'酸枣','酸枣','面食','无'),(317,'樱桃','樱桃','面食','无'),(318,'葡萄','葡萄','面食','无'),(319,'红玫瑰葡萄','红玫瑰葡萄','面食','无'),(320,'巨峰葡萄','巨峰葡萄','面食','无'),(321,'马奶子葡萄','马奶子葡萄','面食','无'),(322,'玫瑰香葡萄','玫瑰香葡萄','面食','无'),(323,'紫葡萄','紫葡萄','面食','无'),(324,'葡萄干','葡萄干','面食','无'),(325,'石榴','石榴','面食','无'),(326,'红粉皮石榴','红粉皮石榴','面食','无'),(327,'玛瑙石榴','玛瑙石榴','面食','无'),(328,'青皮石榴','青皮石榴','面食','无'),(329,'柿','柿','面食','无'),(330,'荷柿','荷柿','面食','无'),(331,'磨盘柿','磨盘柿','面食','无'),(332,'柿饼','柿饼','面食','无'),(333,'桑葚','桑葚','面食','无'),(334,'无花果','无花果','面食','无'),(335,'中华猕猴桃','中华猕猴桃','面食','无'),(336,'草莓','草莓','面食','无'),(337,'红提子葡萄','红提子葡萄','面食','无'),(338,'无花果（干）','无花果（干）','面食','无'),(339,'橙','橙','面食','无'),(340,'柑橘','柑橘','面食','无'),(341,'福橘','福橘','面食','无'),(342,'金橘','金橘','面食','无'),(343,'芦柑','芦柑','面食','无'),(344,'蜜橘','蜜橘','面食','无'),(345,'三湖红橘','三湖红橘','面食','无'),(346,'四川红橘','四川红橘','面食','无'),(347,'橘饼','橘饼','面食','无'),(348,'柚','柚','面食','无'),(349,'柠檬','柠檬','面食','无'),(350,'西柚','西柚','面食','无'),(351,'芭蕉','芭蕉','面食','无'),(352,'菠萝','菠萝','面食','无'),(353,'菠萝蜜','菠萝蜜','面食','无'),(354,'刺梨','刺梨','面食','无'),(355,'番石榴','番石榴','面食','无'),(356,'桂圆','桂圆','面食','无'),(357,'桂圆肉','桂圆肉','面食','无'),(358,'荔枝','荔枝','面食','无'),(359,'芒果','芒果','面食','无'),(360,'木瓜','木瓜','面食','无'),(361,'人参果','人参果','面食','无'),(362,'香蕉','香蕉','面食','无'),(363,'杨梅','杨梅','面食','无'),(364,'杨桃','杨桃','面食','无'),(365,'枇杷','枇杷','面食','无'),(366,'橄榄','橄榄','面食','无'),(367,'红毛丹','红毛丹','面食','无'),(368,'火龙果','火龙果','面食','无'),(369,'荔枝（干）','荔枝（干）','面食','无'),(370,'榴莲','榴莲','面食','无'),(371,'酸木瓜','酸木瓜','面食','无'),(372,'蒲桃','蒲桃','面食','无'),(373,'山竹','山竹','面食','无'),(374,'白金瓜','白金瓜','面食','无'),(375,'白兰瓜','白兰瓜','面食','无'),(376,'哈密瓜','哈密瓜','面食','无'),(377,'黄河蜜瓜','黄河蜜瓜','面食','无'),(378,'甜瓜','甜瓜','面食','无'),(379,'西瓜','西瓜','面食','无'),(380,'小西瓜','小西瓜','面食','无'),(381,'白果（干）','白果（干）','面食','无'),(382,'菠萝蜜子','菠萝蜜子','面食','无'),(383,'毛核桃','毛核桃','面食','无'),(384,'山核桃','山核桃','面食','无'),(385,'栗子（熟）','栗子（熟）','面食','无'),(386,'松子（炒）','松子（炒）','面食','无'),(387,'松子仁','松子仁','面食','无'),(388,'杏仁（炒）','杏仁（炒）','面食','无'),(389,'榛子（炒）','榛子（炒）','面食','无'),(390,'栗子仁','栗子仁','面食','无'),(391,'松子','松子','面食','无'),(392,'杏仁','杏仁','面食','无'),(393,'腰果','腰果','面食','无'),(394,'榛子','榛子','面食','无'),(395,'榛子仁','榛子仁','面食','无'),(396,'开心果','开心果','面食','无'),(397,'香榧','香榧','面食','无'),(398,'花生（鲜）','花生（鲜）','面食','无'),(399,'花生（炒）','花生（炒）','面食','无'),(400,'花生仁（炒）','花生仁（炒）','面食','无'),(401,'葵花子（炒）','葵花子（炒）','面食','无'),(402,'葵花子仁','葵花子仁','面食','无'),(403,'莲子（干）','莲子（干）','面食','无'),(404,'南瓜子（炒）','南瓜子（炒）','面食','无'),(405,'南瓜子仁','南瓜子仁','面食','无'),(406,'西瓜子','西瓜子','面食','无'),(407,'西瓜子仁','西瓜子仁','面食','无'),(408,'花生','花生','面食','无'),(409,'花生仁（油炸）','花生仁（油炸）','面食','无'),(410,'猪肉','猪肉','面食','无'),(411,'猪肉（里脊)','猪肉（里脊)','面食','无'),(412,'猪大肠','猪大肠','面食','无'),(413,'猪大排','猪大排','面食','无'),(414,'猪耳','猪耳','面食','无'),(415,'猪蹄','猪蹄','面食','无'),(416,'猪蹄筋','猪蹄筋','面食','无'),(417,'猪头皮','猪头皮','面食','无'),(418,'猪小排','猪小排','面食','无'),(419,'猪肘棒','猪肘棒','面食','无'),(420,'猪皮','猪皮','面食','无'),(421,'猪肚','猪肚','面食','无'),(422,'猪肺','猪肺','面食','无'),(423,'猪肝','猪肝','面食','无'),(424,'猪脑','猪脑','面食','无'),(425,'猪脾','猪脾','面食','无'),(426,'猪舌','猪舌','面食','无'),(427,'猪肾','猪肾','面食','无'),(428,'猪小肠','猪小肠','面食','无'),(429,'猪心','猪心','面食','无'),(430,'猪血','猪血','面食','无'),(431,'叉烧肉','叉烧肉','面食','无'),(432,'酱汁肉','酱汁肉','面食','无'),(433,'卤猪杂','卤猪杂','面食','无'),(434,'咸肉','咸肉','面食','无'),(435,'猪肉松','猪肉松','面食','无'),(436,'火腿心肉','火腿心肉','面食','无'),(437,'腊肉','腊肉','面食','无'),(438,'酱排骨','酱排骨','面食','无'),(439,'香糟块肉','香糟块肉','面食','无'),(440,'猪肉脯','猪肉脯','面食','无'),(441,'肉酥','肉酥','面食','无'),(442,'酱肘子','酱肘子','面食','无'),(443,'大肉肠','大肉肠','面食','无'),(444,'儿童肠','儿童肠','面食','无'),(445,'风干肠','风干肠','面食','无'),(446,'广东香肠','广东香肠','面食','无'),(447,'火腿肠','火腿肠','面食','无'),(448,'腊肠','腊肠','面食','无'),(449,'松江肠','松江肠','面食','无'),(450,'蒜肠','蒜肠','面食','无'),(451,'香肠','香肠','面食','无'),(452,'小红肠','小红肠','面食','无'),(453,'小泥肠','小泥肠','面食','无'),(454,'午餐肠','午餐肠','面食','无'),(455,'火腿','火腿','面食','无'),(456,'金华火腿','金华火腿','面食','无'),(457,'脆皮肠','脆皮肠','面食','无'),(458,'热狗肠','热狗肠','面食','无'),(459,'三明治火腿','三明治火腿','面食','无'),(460,'午餐肉','午餐肉','面食','无'),(461,'牛肉','牛肉','面食','无'),(462,'牛蹄筋','牛蹄筋','面食','无'),(463,'牛大肠','牛大肠','面食','无'),(464,'牛肚','牛肚','面食','无'),(465,'牛肺','牛肺','面食','无'),(466,'牛肝','牛肝','面食','无'),(467,'牛脑','牛脑','面食','无'),(468,'牛舌','牛舌','面食','无'),(469,'牛肾','牛肾','面食','无'),(470,'牛心','牛心','面食','无'),(471,'牛百叶','牛百叶','面食','无'),(472,'酱牛肉','酱牛肉','面食','无'),(473,'牛肉干','牛肉干','面食','无'),(474,'牛肉松','牛肉松','面食','无'),(475,'牛腱子','牛腱子','面食','无'),(476,'羊肉','羊肉','面食','无'),(477,'羊肉（里脊）','羊肉（里脊）','面食','无'),(478,'山羊肉','山羊肉','面食','无'),(479,'羊蹄筋（生）','羊蹄筋（生）','面食','无'),(480,'羊蹄筋（泡发）','羊蹄筋（泡发）','面食','无'),(481,'羊肉片','羊肉片','面食','无'),(482,'羊大肠','羊大肠','面食','无'),(483,'羊肚','羊肚','面食','无'),(484,'羊肺','羊肺','面食','无'),(485,'羊肝','羊肝','面食','无'),(486,'羊脑','羊脑','面食','无'),(487,'羊舌','羊舌','面食','无'),(488,'羊肾','羊肾','面食','无'),(489,'羊心','羊心','面食','无'),(490,'腊羊肉','腊羊肉','面食','无'),(491,'羊肉串','羊肉串','面食','无'),(492,'羊肉干','羊肉干','面食','无'),(493,'山羊肉（酱）','山羊肉（酱）','面食','无'),(494,'驴肉','驴肉','面食','无'),(495,'兔肉','兔肉','面食','无'),(496,'鸡','鸡','面食','无'),(497,'鸡胸脯肉','鸡胸脯肉','面食','无'),(498,'鸡翅','鸡翅','面食','无'),(499,'鸡腿','鸡腿','面食','无'),(500,'鸡爪','鸡爪','面食','无'),(501,'鸡块','鸡块','面食','无'),(502,'山鸡','山鸡','面食','无'),(503,'鸡肝','鸡肝','面食','无'),(504,'鸡心','鸡心','面食','无'),(505,'鸡血','鸡血','面食','无'),(506,'鸡胗','鸡胗','面食','无'),(507,'扒鸡','扒鸡','面食','无'),(508,'烤鸡','烤鸡','面食','无'),(509,'卤煮鸡','卤煮鸡','面食','无'),(510,'瓦罐鸡汤（肉）','瓦罐鸡汤（肉）','面食','无'),(511,'瓦罐鸡汤（汤）','瓦罐鸡汤（汤）','面食','无'),(512,'鸡肉松','鸡肉松','面食','无'),(513,'童子鸡','童子鸡','面食','无'),(514,'鸭','鸭','面食','无'),(515,'鸭胸脯肉','鸭胸脯肉','面食','无'),(516,'鸭皮','鸭皮','面食','无'),(517,'鸭翅','鸭翅','面食','无'),(518,'鸭掌','鸭掌','面食','无'),(519,'鸭肠','鸭肠','面食','无'),(520,'鸭肝','鸭肝','面食','无'),(521,'鸭舌','鸭舌','面食','无'),(522,'鸭心','鸭心','面食','无'),(523,'鸭血','鸭血','面食','无'),(524,'鸭胰','鸭胰','面食','无'),(525,'鸭肫','鸭肫','面食','无'),(526,'北京烤鸭','北京烤鸭','面食','无'),(527,'北京填鸭','北京填鸭','面食','无'),(528,'酱鸭','酱鸭','面食','无'),(529,'盐水鸭','盐水鸭','面食','无'),(530,'鹅','鹅','面食','无'),(531,'鹅肝','鹅肝','面食','无'),(532,'鹅胗','鹅胗','面食','无'),(533,'烧鹅','烧鹅','面食','无'),(534,'腊鹅','腊鹅','面食','无'),(535,'火鸡腿','火鸡腿','面食','无'),(536,'火鸡胸脯肉','火鸡胸脯肉','面食','无'),(537,'火鸡肝','火鸡肝','面食','无'),(538,'火鸡胗','火鸡胗','面食','无'),(539,'鸽','鸽','面食','无'),(540,'鹌鹑','鹌鹑','面食','无'),(541,'乳鸽','乳鸽','面食','无'),(542,'白条鱼','白条鱼','面食','无'),(543,'草鱼','草鱼','面食','无'),(544,'黄鳝','黄鳝','面食','无'),(545,'黄鳝丝','黄鳝丝','面食','无'),(546,'鲤鱼','鲤鱼','面食','无'),(547,'泥鳅','泥鳅','面食','无'),(548,'青鱼','青鱼','面食','无'),(549,'黑鱼','黑鱼','面食','无'),(550,'银鱼','银鱼','面食','无'),(551,'湟鱼','湟鱼','面食','无'),(552,'鲶鱼','鲶鱼','面食','无'),(553,'江鲫','江鲫','面食','无'),(554,'鲢鱼','鲢鱼','面食','无'),(555,'鲫鱼','鲫鱼','面食','无'),(556,'鲮鱼','鲮鱼','面食','无'),(557,'鳊鱼','鳊鱼','面食','无'),(558,'河鳗','河鳗','面食','无'),(559,'胖头鱼','胖头鱼','面食','无'),(560,'桂鱼','桂鱼','面食','无'),(561,'白姑鱼','白姑鱼','面食','无'),(562,'带鱼','带鱼','面食','无'),(563,'海鲫鱼','海鲫鱼','面食','无'),(564,'海鳗','海鳗','面食','无'),(565,'黄姑鱼','黄姑鱼','面食','无'),(566,'黄鱼','黄鱼','面食','无'),(567,'金线鱼','金线鱼','面食','无'),(568,'沙丁鱼','沙丁鱼','面食','无'),(569,'沙钻鱼','沙钻鱼','面食','无'),(570,'鲅鱼','鲅鱼','面食','无'),(571,'鲈鱼','鲈鱼','面食','无'),(572,'青花鱼','青花鱼','面食','无'),(573,'鲑鱼','鲑鱼','面食','无'),(574,'鲑鱼子酱','鲑鱼子酱','面食','无'),(575,'鲳鱼','鲳鱼','面食','无'),(576,'比目鱼','比目鱼','面食','无'),(577,'鳕鱼','鳕鱼','面食','无'),(578,'鱼排','鱼排','面食','无'),(579,'鱼丸','鱼丸','面食','无'),(580,'草鱼（熏）','草鱼（熏）','面食','无'),(581,'丁香鱼','丁香鱼','面食','无'),(582,'凤尾鱼','凤尾鱼','面食','无'),(583,'金枪鱼','金枪鱼','面食','无'),(584,'鳗鱼','鳗鱼','面食','无'),(585,'鳕鱼(炸）','鳕鱼(炸）','面食','无'),(586,'白米虾','白米虾','面食','无'),(587,'草虾','草虾','面食','无'),(588,'大虾','大虾','面食','无'),(589,'刺蛄','刺蛄','面食','无'),(590,'对虾','对虾','面食','无'),(591,'海虾','海虾','面食','无'),(592,'河虾','河虾','面食','无'),(593,'基围虾','基围虾','面食','无'),(594,'沼虾','沼虾','面食','无'),(595,'龙虾','龙虾','面食','无'),(596,'明虾','明虾','面食','无'),(597,'虾虎','虾虎','面食','无'),(598,'虾皮','虾皮','面食','无'),(599,'螯虾','螯虾','面食','无'),(600,'虾米','虾米','面食','无'),(601,'虾仁','虾仁','面食','无'),(602,'虾仁肉丸','虾仁肉丸','面食','无'),(603,'海蟹','海蟹','面食','无'),(604,'河蟹','河蟹','面食','无'),(605,'青蟹','青蟹','面食','无'),(606,'梭子蟹','梭子蟹','面食','无'),(607,'蟹肉','蟹肉','面食','无'),(608,'鲍鱼','鲍鱼','面食','无'),(609,'鲍鱼（干）','鲍鱼（干）','面食','无'),(610,'蛏子','蛏子','面食','无'),(611,'蛏干','蛏干','面食','无'),(612,'赤贝','赤贝','面食','无'),(613,'河蚌','河蚌','面食','无'),(614,'河蚬','河蚬','面食','无'),(615,'牡蛎','牡蛎','面食','无'),(616,'生蚝','生蚝','面食','无'),(617,'泥蚶','泥蚶','面食','无'),(618,'扇贝（鲜）','扇贝（鲜）','面食','无'),(619,'扇贝（干）','扇贝（干）','面食','无'),(620,'鲜贝','鲜贝','面食','无'),(621,'银蚶','银蚶','面食','无'),(622,'贻贝（鲜）','贻贝（鲜）','面食','无'),(623,'贻贝（干）','贻贝（干）','面食','无'),(624,'海蚌','海蚌','面食','无'),(625,'蛤蜊','蛤蜊','面食','无'),(626,'花蛤蜊','花蛤蜊','面食','无'),(627,'毛蛤蜊','毛蛤蜊','面食','无'),(628,'秋蛤蜊','秋蛤蜊','面食','无'),(629,'沙蛤蜊','沙蛤蜊','面食','无'),(630,'螺','螺','面食','无'),(631,'红螺','红螺','面食','无'),(632,'黄螺','黄螺','面食','无'),(633,'螺蛳','螺蛳','面食','无'),(634,'石螺','石螺','面食','无'),(635,'田螺','田螺','面食','无'),(636,'海参','海参','面食','无'),(637,'海蜇皮','海蜇皮','面食','无'),(638,'海蜇头','海蜇头','面食','无'),(639,'墨鱼','墨鱼','面食','无'),(640,'乌贼','乌贼','面食','无'),(641,'鱿鱼','鱿鱼','面食','无'),(642,'章鱼','章鱼','面食','无'),(643,'墨鱼圈','墨鱼圈','面食','无'),(644,'墨鱼丸','墨鱼丸','面食','无'),(645,'牛乳','牛乳','面食','无'),(646,'牛奶','牛奶','面食','无'),(647,'鲜羊乳','鲜羊乳','面食','无'),(648,'牛乳粉','牛乳粉','面食','无'),(649,'全脂加糖奶粉','全脂加糖奶粉','面食','无'),(650,'全脂牛奶粉','全脂牛奶粉','面食','无'),(651,'全脂奶粉','全脂奶粉','面食','无'),(652,'全脂甜奶粉','全脂甜奶粉','面食','无'),(653,'低脂奶粉','低脂奶粉','面食','无'),(654,'高钙高铁奶粉','高钙高铁奶粉','面食','无'),(655,'全脂羊乳粉','全脂羊乳粉','面食','无'),(656,'酸奶','酸奶','面食','无'),(657,'契达干酪（普通）','契达干酪（普通）','面食','无'),(658,'契达干酪（脱脂）','契达干酪（脱脂）','面食','无'),(659,'全脂软酪','全脂软酪','面食','无'),(660,'羊乳酪','羊乳酪','面食','无'),(661,'中脂软酪','中脂软酪','面食','无'),(662,'奶酪','奶酪','面食','无'),(663,'低脂奶酪','低脂奶酪','面食','无'),(664,'硬质干酪','硬质干酪','面食','无'),(665,'奶皮子','奶皮子','面食','无'),(666,'全脂甜炼乳','全脂甜炼乳','面食','无'),(667,'脱脂甜炼乳','脱脂甜炼乳','面食','无'),(668,'鸡蛋','鸡蛋','面食','无'),(669,'乌鸡蛋','乌鸡蛋','面食','无'),(670,'荷包蛋','荷包蛋','面食','无'),(671,'鸭蛋','鸭蛋','面食','无'),(672,'海鸭蛋','海鸭蛋','面食','无'),(673,'鹅蛋（煮)','鹅蛋（煮)','面食','无');
/*!40000 ALTER TABLE `t_foodbase` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_manager`
--

DROP TABLE IF EXISTS `t_manager`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_manager` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(20) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `text` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `img` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `url` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `type` int DEFAULT NULL COMMENT '1:文章；2：问卷；3：视频',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_manager`
--

LOCK TABLES `t_manager` WRITE;
/*!40000 ALTER TABLE `t_manager` DISABLE KEYS */;
INSERT INTO `t_manager` VALUES (3,'五禽戏','五禽戏','fiveAnimals.jpg','https://haokan.baidu.com/v?pd=wisenatural&vid=9051721854237468694',3),(5,'太极拳','太极拳','bd56e442-1850-4bcc-bf07-d0deacfd7fe7i.jpg','https://haokan.baidu.com/v?vid=10832180685499755407&pd=bjh&fr=bjhauthor&type=video',3),(6,'健身操','健身操','747dfceb-c0ce-4aa2-abff-2eda6c9fe8acn.jpg','https://haokan.baidu.com/v?vid=17633304\n314935414432&pd=bjh&fr=bjhauthor&type=video',3),(7,'养生小短文','养生','25b149a5-f2ec-4b11-9f9a-6e582ce5899e6.jpg','https://www.sohu.com/a/236795713_99916511',1),(8,'养生之道','养生','f8963d01-043e-490c-acce-7063da4744ff0.jpg','https://www.gzkp.org.cn/wxcs/26171.html',1);
/*!40000 ALTER TABLE `t_manager` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_member`
--

DROP TABLE IF EXISTS `t_member`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_member` (
  `id` int NOT NULL AUTO_INCREMENT,
  `fileNumber` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `name` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `sex` varchar(8) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `idCard` varchar(18) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `phoneNumber` varchar(11) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `regTime` date DEFAULT NULL,
  `password` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `email` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `remark` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `age` int DEFAULT NULL,
  PRIMARY KEY (`id`,`phoneNumber`) USING BTREE,
  KEY `id` (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=10049 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_member`
--

LOCK TABLES `t_member` WRITE;
/*!40000 ALTER TABLE `t_member` DISABLE KEYS */;
INSERT INTO `t_member` VALUES (1001,'201801001','李梓熙','1','140603201702032411','18834161222','2019-05-16','123123','1234567890@qq.com','2020-05-26','测试会员1',5),(1002,'201905001','李渊博','0','140603201805063223','18834161225','2019-05-03','111111','317164745@qq.com','2020-06-09','测试会员2',4),(1003,'201904001','王子様','1','140603201909132312','18834161226','2019-04-04','123456','317164745@qq.com','2020-08-15','测试会员3',3),(1004,'201905002','王子岳','1','140603201603032411','18834161227','2019-05-08','123456','317164747@qq.com','2020-08-14','测试会员4',6),(1005,'201904002','张傲然','1','140603201811120315','18834161229','2019-04-05','123456','317164745@qq.com','2020-08-15',NULL,4),(1006,'201904003','白宗沛','0','140603201908064245','18834161230','2019-04-10','123456','317164745@qq.com','2020-02-12',NULL,3),(1007,'201903001','张梓熙','1','140603201911231212','18834161231','2019-03-08','123456','317164745@qq.com','2020-07-16',NULL,3),(1008,'201903002','李四','1','140603199805064212','18831211124','2019-03-09','123456','317164745@qq.com','2020-08-20',NULL,23),(1009,'201903003','卡密尔','1','140603201901011212','18831211125','2019-03-15','123456','317164745@qq.com','2020-08-19',NULL,3),(10010,'201903004','郝靖萱','0','140603201805060203','18831211126','2019-03-15','123456','317164745@qq.com','2020-08-06',NULL,4),(10011,'201903006','胡思','0','140603199506030102','18831211130','2019-03-15','123456','317164745@qq.com','2020-08-07',NULL,26),(10012,'201902001','李林','1','140603199803121212','18831211131','2019-02-15','123456','317164745@qq.com','2020-08-15',NULL,23),(10013,'201902001','王曦','1','140603199805060312','18831211132','2019-02-15','123456','','2020-08-06',NULL,23),(10014,'201902003','李思思','0','140603199802032425','18831211133','2019-02-15','123456','317164745@qq.com',NULL,NULL,23),(10015,'201902006','乌苏','0','140603199702232323','18831211135','2019-02-15','123456','317164745@qq.com',NULL,NULL,24),(10016,'201901003','胡苏','1','140603199803061212','18831211136','2019-01-15','123456','317164745@qq.com',NULL,NULL,23),(10017,'201901002','卡莎','1','140603199805065656','18831211140','2019-01-15','123456','317164745@qq.com',NULL,NULL,23),(10018,'201801002','范世','0','140603198805062323','18831211141','2020-08-21','77','','2020-08-30','',33),(10019,'201801002','乐磊','1','140603199808083232','18831211151','2019-01-15','33434','fdf@423','2020-08-15',NULL,23),(10037,'202008001','孟芸帆','1','140603201708095656','18831211156','2020-08-18','132','mengyunfan@126.com',NULL,NULL,5),(10038,'202008002','韩式','0','140603198005064545','18831211200','2020-08-18','21312',NULL,'2015-09-12',NULL,41),(10039,'202008003','凯视达','0','140603199506060606','18831211201','2020-08-21','321',NULL,NULL,NULL,26),(10040,'202105001','李哥','0','140603199808082323','18831211202','2021-05-26','979d472a84804b9f647bc185a877a8b5',NULL,NULL,NULL,23),(10041,'202105003','马克','0','140603198409062323','18831211204','2021-05-26','202cb962ac59075b964b07152d234b70','1707004420@nuc.edu.cn',NULL,NULL,37),(10042,'202005005','侯睿宏','1','140603199802032412','18834161276','2021-05-26','e10adc3949ba59abbe56e057f20f883e','2649429472@qq.com','1998-02-03',NULL,23),(10043,'202105006','韩山','0','140603199802032422','18834161277','2021-05-27','14e1b600b1fd579f47433b88e8d85291','2649429434@qq.com','1998-02-03',NULL,23),(10044,'202105009','汉斯','1','140603199802035656','18834161278','2021-05-27','14e1b600b1fd579f47433b88e8d85291','2649429473@qq.com','1998-02-03',NULL,23),(10045,'202405010','樟树','0','140603192002032444','18834161279','2021-05-27','14e1b600b1fd579f47433b88e8d85291','2649429479@qq.com','1998-02-03',NULL,101),(10047,'202105010','章李','1','140603198005052231','18831212222','2021-05-27','14e1b600b1fd579f47433b88e8d85291','23233223@qq.com','1980-05-05',NULL,41),(10048,'202205016','张珊','1','140603199802031111','18813223121','2021-05-28','e10adc3949ba59abbe56e057f20f883e',NULL,'1998-02-03',NULL,23);
/*!40000 ALTER TABLE `t_member` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_menu`
--

DROP TABLE IF EXISTS `t_menu`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_menu` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `linkUrl` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `path` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `priority` int DEFAULT NULL,
  `icon` varchar(64) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `description` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `parentMenuId` int DEFAULT NULL,
  `level` int DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  KEY `FK_Reference_13` (`parentMenuId`) USING BTREE,
  CONSTRAINT `FK_Reference_13` FOREIGN KEY (`parentMenuId`) REFERENCES `t_menu` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=60 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_menu`
--

LOCK TABLES `t_menu` WRITE;
/*!40000 ALTER TABLE `t_menu` DISABLE KEYS */;
INSERT INTO `t_menu` VALUES (1,'会员管理',NULL,'2',2,'fa-user-md',NULL,NULL,1),(2,'会员档案','/member','/2-1',1,NULL,NULL,1,2),(4,'统计分析','/report-member','/2-3',3,NULL,NULL,1,2),(5,'健康监测管理',NULL,'3',3,'fa-tty',NULL,NULL,1),(6,'预约列表','/ordersettinglist','/3-1',1,NULL,NULL,5,2),(7,'预约设置','/ordersetting','/3-2',2,NULL,NULL,5,2),(8,'套餐管理','/setmeal','/3-3',3,NULL,NULL,5,2),(9,'项目组管理','/checkgroup','/3-4',4,NULL,NULL,5,2),(10,'项目管理','/checkitem','/3-5',5,NULL,NULL,5,2),(11,'保健知识库',NULL,'4',4,'fa-book',NULL,NULL,1),(13,'咨询管理',NULL,'5',5,'fa-phone',NULL,NULL,1),(15,'儿童保健',NULL,'6',6,'fa-desktop',NULL,NULL,1),(16,'保健模板','/people-manager','/6-1',1,NULL,NULL,15,2),(17,'保健方案','/health-plan','/6-2',2,NULL,NULL,15,2),(29,'系统设置',NULL,'7',7,'fa-cog',NULL,NULL,1),(30,'菜单管理','/system-list','/7-1',1,NULL,NULL,29,2),(31,'权限管理','/permission','/7-2',2,NULL,NULL,29,2),(43,'工作台',NULL,'1',1,'fa-dashboard',NULL,NULL,1),(46,'运动知识库','/sport','/4-3',2,NULL,NULL,11,2),(47,'膳食知识库','/food','/4-4',3,NULL,NULL,11,2),(48,'疾病知识库','/illness','/4-5',4,NULL,NULL,11,2),(49,'用户管理','/user-controller','/7-3',3,NULL,NULL,29,2),(50,'角色管理','/role-list','/7-4',4,NULL,NULL,29,2),(55,'保健资讯','/query','/5-1',1,NULL,NULL,13,2),(56,'预约列表','/ordersettinglist','/1-1',1,NULL,NULL,43,2),(57,'会员档案','/member','/1-2',2,NULL,NULL,43,2),(58,'儿童保健','/health-plan','/1-3',3,NULL,NULL,43,2);
/*!40000 ALTER TABLE `t_menu` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_order`
--

DROP TABLE IF EXISTS `t_order`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_order` (
  `id` int NOT NULL AUTO_INCREMENT,
  `member_id` int DEFAULT NULL COMMENT 'Ա��id',
  `orderDate` date DEFAULT NULL COMMENT 'ԼԤ����',
  `orderType` varchar(8) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL COMMENT 'ԼԤ���� �绰ԤԼ/΢��ԤԼ',
  `orderStatus` varchar(8) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL COMMENT 'ԤԼ״̬���Ƿ��',
  `setmeal_id` int DEFAULT NULL COMMENT '����id',
  `organizationPhone` varchar(11) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `url` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  KEY `FK_Reference_6` (`setmeal_id`) USING BTREE,
  KEY `key_member_id` (`member_id`) USING BTREE,
  CONSTRAINT `FK_Reference_6` FOREIGN KEY (`setmeal_id`) REFERENCES `t_setmeal` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `key_member_id` FOREIGN KEY (`member_id`) REFERENCES `t_member` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=26 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_order`
--

LOCK TABLES `t_order` WRITE;
/*!40000 ALTER TABLE `t_order` DISABLE KEYS */;
INSERT INTO `t_order` VALUES (4,1001,'2019-06-27','微信预约','已到诊',12,NULL,'111'),(6,1002,'2019-07-01','微信预约','已到诊',13,NULL,'222'),(8,1003,'2019-07-03','微信预约','未到诊',15,NULL,'333'),(10,10038,'2020-08-19','微信预约','未到诊',12,NULL,'44'),(11,10039,'2020-08-01','电话预约','未到诊',12,'123333333','55'),(12,10039,'2020-08-01','电话预约','未到诊',13,'123333333','556'),(13,10038,'2020-08-22','微信预约','已到诊',14,NULL,'777'),(15,10042,'2021-05-27','微信预约','未到诊',13,NULL,'999'),(16,10042,'2021-05-27','电话预约','已到诊',12,NULL,'e6414520-8fe4-4231-8756-191ce2bc6e111.jpg'),(17,10042,'2021-05-28','电话预约','未到诊',13,'123456','4ac12332-0ca1-4b76-910a-c538a93910121.jpg'),(18,10042,'2021-05-28','电话预约','未到诊',12,NULL,NULL),(19,10042,'2021-05-28','电话预约','未到诊',14,NULL,NULL),(20,10042,'2021-06-01','微信预约','未到诊',15,NULL,NULL),(21,10042,'2021-06-11','微信预约','已到诊',14,NULL,'7781727e-d617-4ec2-b065-48f49397f1061.jpg'),(22,10042,'2021-06-06','微信预约','未到诊',12,NULL,NULL),(23,10042,'2021-06-07','微信预约','已到诊',12,NULL,NULL),(24,10042,'2022-07-21','电话预约','未到诊',12,NULL,'4de51034-6a78-4fd5-b257-1a4ecf44159fM.jpeg'),(25,10042,'2022-07-21','电话预约','未到诊',15,NULL,NULL);
/*!40000 ALTER TABLE `t_order` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_ordersetting`
--

DROP TABLE IF EXISTS `t_ordersetting`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_ordersetting` (
  `id` int NOT NULL AUTO_INCREMENT,
  `orderDate` date DEFAULT NULL COMMENT 'ԼԤ����',
  `number` int DEFAULT NULL COMMENT '��ԤԼ����',
  `reservations` int DEFAULT NULL COMMENT '��ԤԼ����',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=470 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT COMMENT='ԤԼ����';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_ordersetting`
--

LOCK TABLES `t_ordersetting` WRITE;
/*!40000 ALTER TABLE `t_ordersetting` DISABLE KEYS */;
INSERT INTO `t_ordersetting` VALUES (1,'2019-10-10',300,0),(2,'2019-10-11',300,0),(3,'2019-10-12',300,0),(4,'2019-10-13',300,0),(5,'2019-10-14',300,0),(6,'2019-10-15',300,0),(7,'2019-10-16',300,0),(8,'2019-10-17',300,0),(9,'2019-10-18',300,0),(10,'2019-10-19',300,0),(11,'2019-10-20',300,0),(12,'2019-10-21',300,0),(13,'2019-10-22',300,0),(14,'2019-10-23',300,0),(15,'2019-10-24',300,0),(16,'2019-10-25',300,0),(17,'2019-10-26',300,0),(18,'2019-10-27',300,0),(19,'2019-10-28',300,0),(20,'2019-10-29',300,0),(21,'2019-10-30',300,0),(22,'2019-10-31',300,0),(23,'2019-11-01',300,0),(24,'2019-11-02',300,0),(25,'2019-11-03',300,0),(26,'2019-11-04',300,0),(27,'2019-11-05',300,0),(28,'2019-11-06',300,0),(29,'2019-11-07',300,0),(30,'2019-11-08',300,0),(31,'2019-11-09',300,0),(32,'2019-11-10',300,0),(33,'2019-11-11',300,0),(34,'2019-11-12',300,0),(35,'2019-11-13',300,0),(36,'2019-11-14',300,0),(37,'2019-11-15',300,0),(38,'2019-11-16',300,0),(39,'2019-11-17',300,0),(40,'2019-11-18',300,0),(41,'2019-11-19',300,0),(42,'2019-11-20',300,0),(43,'2019-11-21',300,0),(44,'2019-11-22',300,0),(45,'2019-11-23',300,0),(46,'2019-11-24',300,0),(47,'2019-11-25',300,0),(48,'2019-11-26',300,0),(49,'2019-11-27',300,0),(50,'2019-11-28',300,0),(51,'2019-11-29',300,0),(52,'2019-11-30',300,0),(53,'2019-12-01',300,0),(54,'2019-12-02',300,0),(55,'2019-12-03',300,0),(56,'2019-12-04',300,0),(57,'2019-12-05',300,0),(58,'2019-12-06',300,0),(59,'2019-12-07',300,0),(60,'2019-12-08',300,0),(61,'2019-12-09',300,0),(62,'2019-12-10',300,0),(63,'2019-12-11',300,0),(64,'2019-12-12',300,0),(65,'2019-12-13',300,0),(66,'2019-12-14',300,0),(67,'2019-12-15',300,0),(68,'2019-12-16',300,0),(69,'2019-12-17',300,0),(70,'2019-12-18',300,0),(71,'2019-12-19',300,0),(72,'2019-12-20',300,0),(73,'2019-12-21',300,0),(74,'2019-12-22',300,0),(75,'2019-12-23',300,0),(76,'2019-12-24',300,0),(77,'2019-12-25',300,0),(78,'2019-12-26',300,0),(79,'2019-12-27',300,0),(80,'2019-12-28',300,0),(81,'2019-12-29',300,0),(82,'2019-12-30',300,0),(83,'2019-12-31',300,0),(84,'2020-01-01',300,0),(85,'2020-01-02',300,0),(86,'2020-01-03',300,0),(87,'2020-01-04',300,0),(88,'2020-01-05',300,0),(89,'2020-01-06',300,0),(90,'2020-01-07',300,0),(91,'2020-01-08',300,0),(92,'2020-01-09',300,0),(93,'2020-01-10',300,0),(94,'2020-01-11',300,0),(95,'2020-01-12',300,0),(96,'2020-01-13',300,0),(97,'2020-01-14',300,0),(98,'2020-01-15',300,0),(99,'2020-01-16',300,0),(100,'2020-01-17',300,0),(101,'2020-01-18',300,0),(102,'2020-01-19',300,0),(103,'2020-01-20',300,0),(104,'2020-01-21',300,0),(105,'2020-01-22',300,0),(106,'2020-01-23',300,0),(107,'2020-01-24',300,0),(108,'2020-01-25',300,0),(109,'2020-01-26',300,0),(110,'2020-01-27',300,0),(111,'2020-01-28',300,0),(112,'2020-01-29',300,0),(113,'2020-01-30',300,0),(114,'2020-01-31',300,0),(115,'2020-02-01',300,0),(116,'2020-02-02',300,0),(117,'2020-02-03',300,0),(118,'2020-02-04',300,0),(119,'2020-02-05',300,0),(120,'2020-02-06',300,0),(121,'2020-02-07',300,0),(122,'2020-02-08',300,0),(123,'2020-02-09',300,0),(124,'2020-02-10',300,0),(125,'2020-02-11',300,0),(126,'2020-02-12',300,0),(127,'2020-02-13',300,0),(128,'2020-02-14',300,0),(129,'2020-02-15',300,0),(130,'2020-02-16',300,0),(131,'2020-02-17',300,0),(132,'2020-02-18',300,0),(133,'2020-02-19',300,0),(134,'2020-02-20',300,0),(135,'2020-02-21',300,0),(136,'2020-02-22',300,0),(137,'2020-02-23',300,0),(138,'2020-02-24',300,0),(139,'2020-02-25',300,0),(140,'2020-02-26',300,0),(141,'2020-02-27',300,0),(142,'2020-02-28',300,0),(143,'2020-02-29',300,0),(144,'2020-03-01',300,0),(145,'2020-03-02',300,0),(146,'2020-03-03',300,0),(147,'2020-03-04',300,0),(148,'2020-03-05',300,0),(149,'2020-03-06',300,0),(150,'2020-03-07',300,0),(151,'2020-03-08',300,0),(152,'2020-03-09',300,0),(153,'2020-03-10',300,0),(154,'2020-03-11',300,0),(155,'2020-03-12',300,0),(156,'2020-03-13',300,0),(157,'2020-03-14',300,0),(158,'2020-03-15',300,0),(159,'2020-03-16',300,0),(160,'2020-03-17',300,0),(161,'2020-03-18',300,0),(162,'2020-03-19',300,0),(163,'2020-03-20',300,0),(164,'2020-03-21',300,0),(165,'2020-03-22',300,0),(166,'2020-03-23',300,0),(167,'2020-03-24',300,0),(168,'2020-03-25',300,0),(169,'2020-03-26',300,0),(170,'2020-03-27',300,0),(171,'2020-03-28',300,0),(172,'2020-03-29',300,0),(173,'2020-03-30',300,0),(174,'2020-03-31',300,0),(175,'2020-04-01',300,0),(176,'2020-04-02',300,0),(177,'2020-04-03',300,0),(178,'2020-04-04',300,0),(179,'2020-04-05',300,0),(180,'2020-04-06',300,0),(181,'2020-04-07',300,0),(182,'2020-04-08',300,0),(183,'2020-04-09',300,0),(184,'2020-04-10',300,0),(185,'2020-04-11',300,0),(186,'2020-04-12',300,0),(187,'2020-04-13',300,0),(188,'2020-04-14',300,0),(189,'2020-04-15',300,0),(190,'2020-04-16',300,0),(191,'2020-04-17',300,0),(192,'2020-04-18',300,0),(193,'2020-04-19',300,0),(194,'2020-04-20',300,0),(195,'2020-04-21',300,0),(196,'2020-04-22',300,0),(197,'2020-04-23',300,0),(198,'2020-04-24',300,0),(199,'2020-04-25',300,0),(200,'2020-04-26',300,0),(201,'2020-04-27',300,0),(202,'2020-04-28',300,0),(203,'2020-04-29',300,0),(204,'2020-04-30',300,0),(205,'2020-05-01',300,0),(206,'2020-05-02',300,0),(207,'2020-05-03',300,0),(208,'2020-05-04',300,0),(209,'2020-05-05',300,0),(210,'2020-05-06',300,0),(211,'2020-05-07',300,0),(212,'2020-05-08',300,0),(213,'2020-05-09',300,0),(214,'2020-05-10',300,0),(215,'2020-05-11',300,0),(216,'2020-05-12',300,0),(217,'2020-05-13',300,0),(218,'2020-05-14',300,0),(219,'2020-05-15',300,0),(220,'2020-05-16',300,0),(221,'2020-05-17',300,0),(222,'2020-05-18',300,0),(223,'2020-05-19',300,0),(224,'2020-05-20',300,0),(225,'2020-05-21',300,0),(226,'2020-05-22',300,0),(227,'2020-05-23',300,0),(228,'2020-05-24',300,0),(229,'2020-05-25',300,0),(230,'2020-05-26',300,0),(231,'2020-05-27',300,0),(232,'2020-05-28',300,0),(233,'2020-05-29',300,0),(234,'2020-05-30',300,0),(235,'2020-05-31',300,0),(236,'2020-06-01',300,0),(237,'2020-06-02',300,0),(238,'2020-06-03',300,0),(239,'2020-06-04',300,0),(240,'2020-06-05',300,0),(241,'2020-06-06',300,0),(242,'2020-06-07',300,0),(243,'2020-06-08',300,0),(244,'2020-06-09',300,0),(245,'2020-06-10',300,0),(246,'2020-06-11',300,0),(247,'2020-06-12',300,0),(248,'2020-06-13',300,0),(249,'2020-06-14',300,0),(250,'2020-06-15',300,0),(251,'2020-06-16',300,0),(252,'2020-06-17',300,0),(253,'2020-06-18',300,0),(254,'2020-06-19',300,0),(255,'2020-06-20',300,0),(256,'2020-06-21',300,0),(257,'2020-06-22',300,0),(258,'2020-06-23',300,0),(259,'2020-06-24',300,0),(260,'2020-06-25',300,0),(261,'2020-06-26',300,0),(262,'2020-06-27',300,0),(263,'2020-06-28',300,0),(264,'2020-06-29',300,0),(265,'2020-06-30',300,0),(266,'2020-07-01',300,0),(267,'2020-07-02',300,0),(268,'2020-07-03',300,0),(269,'2020-07-04',300,0),(270,'2020-07-05',300,0),(271,'2020-07-06',300,0),(272,'2020-07-07',300,0),(273,'2020-07-08',300,0),(274,'2020-07-09',300,0),(275,'2020-07-10',300,0),(276,'2020-07-11',300,0),(277,'2020-07-12',300,0),(278,'2020-07-13',300,0),(279,'2020-07-14',300,0),(280,'2020-07-15',300,0),(281,'2020-07-16',300,0),(282,'2020-07-17',300,0),(283,'2020-07-18',300,0),(284,'2020-07-19',300,0),(285,'2020-07-20',300,0),(286,'2020-07-21',300,0),(287,'2020-07-22',300,0),(288,'2020-07-23',300,0),(289,'2020-07-24',300,0),(290,'2020-07-25',300,0),(291,'2020-07-26',300,0),(292,'2020-07-27',300,0),(293,'2020-07-28',300,0),(294,'2020-07-29',300,0),(295,'2020-07-30',300,0),(296,'2020-07-31',300,0),(297,'2020-08-01',300,2),(298,'2020-08-02',300,0),(299,'2020-08-03',300,0),(300,'2020-08-04',300,0),(301,'2020-08-05',300,0),(302,'2020-08-06',300,0),(303,'2020-08-07',300,0),(304,'2020-08-08',300,0),(305,'2020-08-09',300,0),(306,'2020-08-10',300,0),(307,'2020-08-11',300,0),(308,'2020-08-12',300,0),(309,'2020-08-13',300,0),(310,'2020-08-14',300,0),(311,'2020-08-15',300,0),(312,'2020-08-16',300,0),(313,'2020-08-17',300,0),(314,'2020-08-18',300,1),(315,'2020-08-19',300,1),(316,'2020-08-20',300,0),(317,'2020-08-21',300,0),(318,'2020-08-22',300,1),(319,'2020-08-23',300,0),(320,'2020-08-24',300,0),(321,'2020-08-25',300,0),(322,'2020-08-26',300,0),(323,'2020-08-27',300,0),(324,'2020-08-28',300,0),(325,'2020-08-29',300,0),(326,'2020-08-30',300,0),(327,'2020-08-31',300,0),(328,'2020-09-01',300,0),(329,'2020-09-02',300,0),(330,'2020-09-03',300,0),(331,'2020-09-04',300,0),(332,'2020-09-05',300,0),(333,'2020-09-06',300,0),(334,'2020-09-07',300,0),(335,'2020-09-08',300,0),(336,'2020-09-09',300,0),(337,'2020-09-10',300,0),(338,'2020-09-11',300,0),(339,'2020-09-12',300,0),(340,'2020-09-13',300,0),(341,'2020-09-14',300,0),(342,'2020-09-15',300,0),(343,'2020-09-16',300,0),(344,'2020-09-17',300,0),(345,'2020-09-18',300,0),(346,'2020-09-19',300,0),(347,'2020-09-20',300,0),(348,'2020-09-21',300,0),(349,'2020-09-22',300,0),(350,'2020-09-23',300,0),(351,'2020-09-24',300,0),(352,'2020-09-25',300,0),(353,'2020-09-26',300,0),(354,'2020-09-27',300,0),(355,'2020-09-28',300,0),(356,'2020-09-29',300,0),(357,'2020-09-30',300,0),(358,'2020-10-01',300,0),(359,'2020-10-02',300,0),(360,'2020-10-03',300,0),(361,'2020-10-04',300,0),(362,'2020-10-05',300,0),(363,'2020-10-06',300,0),(364,'2020-10-07',300,0),(365,'2020-10-08',300,0),(366,'2020-10-09',300,0),(367,'2020-10-10',300,0),(368,'2020-10-11',300,0),(369,'2020-10-12',300,0),(370,'2020-10-13',300,0),(371,'2020-10-14',300,0),(372,'2020-10-15',300,0),(373,'2020-10-16',300,0),(374,'2020-10-17',300,0),(375,'2020-10-18',300,0),(376,'2020-10-19',300,0),(377,'2020-10-20',300,0),(378,'2020-10-21',300,0),(379,'2020-10-22',300,0),(380,'2020-10-23',300,0),(381,'2020-10-24',300,0),(382,'2020-10-25',300,0),(383,'2020-10-26',300,0),(384,'2020-10-27',300,0),(385,'2020-10-28',300,0),(386,'2020-10-29',300,0),(387,'2020-10-30',300,0),(388,'2020-10-31',300,0),(389,'2020-11-01',300,0),(390,'2020-11-02',300,0),(391,'2020-11-03',300,0),(392,'2020-11-04',300,0),(393,'2020-11-05',300,0),(394,'2020-11-06',300,0),(395,'2020-11-07',300,0),(396,'2020-11-08',300,0),(397,'2020-11-09',300,0),(398,'2020-11-10',300,0),(399,'2020-11-11',300,0),(400,'2020-11-12',300,0),(401,'2020-11-13',300,0),(402,'2020-11-14',300,0),(403,'2020-11-15',300,0),(404,'2020-11-16',300,0),(405,'2020-11-17',300,0),(406,'2020-11-18',300,0),(407,'2020-11-19',300,0),(408,'2020-11-20',300,0),(409,'2020-11-21',300,0),(410,'2020-11-22',300,0),(411,'2020-11-23',300,0),(412,'2020-11-24',300,0),(413,'2020-11-25',300,0),(414,'2020-11-26',300,0),(415,'2020-11-27',300,0),(416,'2020-11-28',300,0),(417,'2020-11-29',300,0),(418,'2020-11-30',300,0),(419,'2020-12-01',300,0),(420,'2020-12-02',300,0),(421,'2020-12-03',300,0),(422,'2020-12-04',300,0),(423,'2020-12-05',300,0),(424,'2020-12-06',300,0),(425,'2020-12-07',300,0),(426,'2020-12-08',300,0),(427,'2020-12-09',300,0),(428,'2020-12-10',300,0),(429,'2020-12-11',300,0),(430,'2020-12-12',300,0),(431,'2020-12-13',300,0),(432,'2020-12-14',300,0),(433,'2020-12-15',300,0),(434,'2020-12-16',300,0),(435,'2020-12-17',300,0),(436,'2020-12-18',300,0),(437,'2020-12-19',300,0),(438,'2020-12-20',300,0),(439,'2020-12-21',300,0),(440,'2020-12-22',300,0),(441,'2020-12-23',300,0),(442,'2020-12-24',300,0),(443,'2020-12-25',300,0),(444,'2020-12-26',300,0),(445,'2020-12-27',300,0),(446,'2020-12-28',300,0),(447,'2020-12-29',300,0),(448,'2020-12-30',300,0),(449,'2020-12-31',300,0),(450,'2021-05-27',20,3),(451,'2021-05-28',20,2),(452,'2021-05-25',20,0),(453,'2021-05-26',20,0),(454,'2021-05-29',20,0),(455,'2021-05-30',20,0),(456,'2021-05-31',20,1),(457,'2021-06-01',20,1),(458,'2021-06-02',20,0),(459,'2021-06-03',20,0),(460,'2021-06-04',20,0),(461,'2021-06-05',20,0),(462,'2021-06-06',20,1),(463,'2021-06-07',20,1),(464,'2021-06-08',20,0),(465,'2021-06-09',20,0),(466,'2021-06-10',20,0),(467,'2021-06-11',20,1),(468,'2021-06-12',12,0),(469,'2022-07-21',20,2);
/*!40000 ALTER TABLE `t_ordersetting` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_permission`
--

DROP TABLE IF EXISTS `t_permission`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_permission` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `keyword` varchar(64) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `description` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `creationDate` date DEFAULT NULL,
  `state` tinyint(1) DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_permission`
--

LOCK TABLES `t_permission` WRITE;
/*!40000 ALTER TABLE `t_permission` DISABLE KEYS */;
INSERT INTO `t_permission` VALUES (1,'新增检查项','CHECKITEM_ADD','新增','2020-08-11',1),(2,'删除检查项','CHECKITEM_DELETE','无','2020-08-11',1),(3,'编辑检查项','CHECKITEM_EDIT','无','2020-08-11',1),(4,'查询检查项','CHECKITEM_QUERY','无','2020-08-11',0),(5,'新增检查组','CHECKGROUP_ADD','无','2020-08-07',0),(6,'删除检查组','CHECKGROUP_DELETE','无','2020-08-07',1),(7,'编辑检查组','CHECKGROUP_EDIT','无','2020-08-07',1),(8,'查询检查组','CHECKGROUP_QUERY','无','2020-08-07',1),(9,'新增套餐','SETMEAL_ADD','无','2020-08-07',1),(10,'删除套餐','SETMEAL_DELETE','无','2020-08-07',1),(11,'编辑套餐','SETMEAL_EDIT','无','2020-08-07',1),(12,'查询套餐','SETMEAL_QUERY','无','2020-08-07',1),(13,'预约设置','ORDERSETTING','无','2020-08-07',1),(14,'查看统计报表','REPORT_VIEW','无','2020-08-07',1),(15,'新增菜单','MENU_ADD','无','2020-08-07',1),(16,'删除菜单','MENU_DELETE','无','2020-08-07',1),(17,'编辑菜单','MENU_EDIT','无','2020-08-07',1),(18,'查询菜单','MENU_QUERY','无','2020-08-07',1),(19,'新增角色','ROLE_ADD','无','2020-08-07',1),(20,'删除角色','ROLE_DELETE','无','2020-08-07',1),(21,'编辑角色','ROLE_EDIT','无','2020-08-07',1),(22,'查询角色','ROLE_QUERY','无','2020-08-07',1),(23,'新增用户','USER_ADD','无','2020-08-07',1),(24,'删除用户','USER_DELETE','无','2020-08-07',1),(25,'编辑用户','USER_EDIT','无','2020-08-07',1),(26,'查询用户','USER_QUERY','无','2020-08-07',1);
/*!40000 ALTER TABLE `t_permission` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_psychology`
--

DROP TABLE IF EXISTS `t_psychology`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_psychology` (
  `id` int NOT NULL AUTO_INCREMENT,
  `number` varchar(16) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `chooseone` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosetwo` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosethree` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosefour` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosefive` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosesix` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `chooseseven` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `chooseeight` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_psychology`
--

LOCK TABLES `t_psychology` WRITE;
/*!40000 ALTER TABLE `t_psychology` DISABLE KEYS */;
INSERT INTO `t_psychology` VALUES (1,'1001','李明','没有','没有','没有','没有','没有','没有','没有','没有','2021-05-24 11:16:22'),(2,'1001','李华','没有','没有','没有','没有','没有','没有','没有','没有',NULL),(3,'1023','李华','没有','没有','没有','没有','没有','没有','没有','没有','2021-05-24 16:51:32'),(4,'10042','侯睿宏','否','否','无','否','一般般','否','否','否','2021-05-27 17:16:27'),(5,'10042','侯睿宏','否','否','无','否','一般般','否','否','否','2021-05-27 18:23:06'),(6,'10042','侯睿宏','否','否','无','否','一般般','否','否','否','2021-05-27 18:25:00');
/*!40000 ALTER TABLE `t_psychology` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_risk`
--

DROP TABLE IF EXISTS `t_risk`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_risk` (
  `id` int NOT NULL AUTO_INCREMENT,
  `number` varchar(16) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `chooseone` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosetwo` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosethree` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosefour` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosefive` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `choosesix` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `chooseseven` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `chooseeight` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_risk`
--

LOCK TABLES `t_risk` WRITE;
/*!40000 ALTER TABLE `t_risk` DISABLE KEYS */;
INSERT INTO `t_risk` VALUES (1,'1001','李明','没有','没有','没有','没有','没有','没有','没有','没有','2021-05-24 11:16:22'),(2,'1001','李华','没有','没有','没有','没有','没有','没有','没有','没有',NULL),(3,'1023','李华','没有','没有','没有','没有','没有','没有','没有','没有','2021-05-24 16:51:32'),(4,'10042','侯睿宏','是','是','是','是','做过','是','是','有胃口','2021-05-27 17:16:27'),(5,'10042','侯睿宏','否','否','否','否','没有做过','否','否','还可以，和平常一样','2021-05-27 18:23:06'),(6,'10042','侯睿宏','否','否','否','否','没有做过','否','否','还可以，和平常一样','2021-05-27 18:25:00');
/*!40000 ALTER TABLE `t_risk` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_role`
--

DROP TABLE IF EXISTS `t_role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_role` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `keyword` varchar(64) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `description` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_role`
--

LOCK TABLES `t_role` WRITE;
/*!40000 ALTER TABLE `t_role` DISABLE KEYS */;
INSERT INTO `t_role` VALUES (1,'系统管理员','ROLE_ADMIN',NULL),(2,'健康管理师','ROLE_HEALTH_MANAGER',NULL),(7,'管理员','gly',NULL);
/*!40000 ALTER TABLE `t_role` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_role_menu`
--

DROP TABLE IF EXISTS `t_role_menu`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_role_menu` (
  `role_id` int NOT NULL,
  `menu_id` int NOT NULL,
  PRIMARY KEY (`role_id`,`menu_id`) USING BTREE,
  KEY `FK_Reference_10` (`menu_id`) USING BTREE,
  CONSTRAINT `FK_Reference_10` FOREIGN KEY (`menu_id`) REFERENCES `t_menu` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `FK_Reference_9` FOREIGN KEY (`role_id`) REFERENCES `t_role` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_role_menu`
--

LOCK TABLES `t_role_menu` WRITE;
/*!40000 ALTER TABLE `t_role_menu` DISABLE KEYS */;
INSERT INTO `t_role_menu` VALUES (1,1),(7,1),(1,2),(7,2),(1,4),(7,4),(1,5),(7,5),(1,6),(7,6),(1,7),(7,7),(1,8),(7,8),(1,9),(7,9),(1,10),(7,10),(1,11),(7,11),(1,13),(7,13),(1,15),(7,15),(1,16),(7,16),(1,17),(7,17),(1,29),(1,30),(1,31),(1,43),(2,43),(7,43),(1,46),(7,46),(1,47),(7,47),(1,48),(7,48),(1,49),(1,50),(1,55),(7,55),(1,56),(7,56),(1,57),(7,57),(1,58),(7,58);
/*!40000 ALTER TABLE `t_role_menu` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_role_permission`
--

DROP TABLE IF EXISTS `t_role_permission`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_role_permission` (
  `role_id` int NOT NULL,
  `permission_id` int NOT NULL,
  PRIMARY KEY (`role_id`,`permission_id`) USING BTREE,
  KEY `FK_Reference_12` (`permission_id`) USING BTREE,
  CONSTRAINT `FK_Reference_11` FOREIGN KEY (`role_id`) REFERENCES `t_role` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `FK_Reference_12` FOREIGN KEY (`permission_id`) REFERENCES `t_permission` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_role_permission`
--

LOCK TABLES `t_role_permission` WRITE;
/*!40000 ALTER TABLE `t_role_permission` DISABLE KEYS */;
INSERT INTO `t_role_permission` VALUES (1,1),(2,1),(7,1),(2,2),(7,2),(2,3),(7,3),(1,4),(2,4),(1,5),(2,5),(1,6),(2,6),(7,6),(1,7),(2,7),(7,7),(1,8),(2,8),(7,8),(1,9),(2,9),(7,9),(1,10),(2,10),(7,10),(1,11),(2,11),(7,11),(2,12),(1,13),(2,13),(7,13),(1,14),(2,14),(1,15),(1,16),(1,17),(1,18),(1,19),(1,20),(1,21),(1,22),(1,23),(7,23),(1,24),(7,24),(1,25),(7,25),(1,26),(7,26);
/*!40000 ALTER TABLE `t_role_permission` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_setmeal`
--

DROP TABLE IF EXISTS `t_setmeal`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_setmeal` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `code` varchar(8) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `helpCode` varchar(16) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `sex` char(1) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `age` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `price` float DEFAULT NULL,
  `remark` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `attention` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `img` varchar(128) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT COMMENT='����ײ�';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_setmeal`
--

LOCK TABLES `t_setmeal` WRITE;
/*!40000 ALTER TABLE `t_setmeal` DISABLE KEYS */;
INSERT INTO `t_setmeal` VALUES (12,'3月龄体检套餐A','0001','SYA','0','0-1',100,'3月龄体检套餐A',NULL,'40ee2559-9aab-4f59-b71a-10fd403d0f9d1.jpg'),(13,'3月龄体检套餐B','0002','SYB','0','0-1',150,'3月龄体检套餐B',NULL,'51095734-e8e4-4943-a60d-50cf55af861f2.jpg'),(14,'6-12月体检套餐A','0003','LUA','0','0-1',180,'6-12月体检套餐A',NULL,'2cac6def-f272-44a6-aa9f-92b1b66a009f3.jpg'),(15,'1-3岁B套餐','0004','YSB','0','1-3',200,'1-3岁B套餐',NULL,'2c28ad32-1e06-4df5-bae8-884fbff9f3b61.jpg'),(16,'学龄期体检套餐B','005','XLQ','0','3-6',248,'学龄期体检套餐B',NULL,NULL);
/*!40000 ALTER TABLE `t_setmeal` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_setmeal_checkgroup`
--

DROP TABLE IF EXISTS `t_setmeal_checkgroup`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_setmeal_checkgroup` (
  `setmeal_id` int NOT NULL DEFAULT '0',
  `checkgroup_id` int NOT NULL DEFAULT '0',
  PRIMARY KEY (`setmeal_id`,`checkgroup_id`) USING BTREE,
  KEY `checkgroup_key` (`checkgroup_id`) USING BTREE,
  CONSTRAINT `checkgroup_key` FOREIGN KEY (`checkgroup_id`) REFERENCES `t_checkgroup` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `setmeal_key` FOREIGN KEY (`setmeal_id`) REFERENCES `t_setmeal` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_setmeal_checkgroup`
--

LOCK TABLES `t_setmeal_checkgroup` WRITE;
/*!40000 ALTER TABLE `t_setmeal_checkgroup` DISABLE KEYS */;
INSERT INTO `t_setmeal_checkgroup` VALUES (12,5),(13,5),(14,5),(15,5),(16,5),(13,6),(14,6),(15,6),(16,6),(16,9),(16,10),(16,11),(16,12),(14,13),(15,13),(16,14),(15,15),(16,15);
/*!40000 ALTER TABLE `t_setmeal_checkgroup` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_sportbase`
--

DROP TABLE IF EXISTS `t_sportbase`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_sportbase` (
  `sportid` int NOT NULL AUTO_INCREMENT,
  `sportcode` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `sportname` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `sporttype` varchar(16) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `sportremark` varchar(256) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  PRIMARY KEY (`sportid`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=213 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_sportbase`
--

LOCK TABLES `t_sportbase` WRITE;
/*!40000 ALTER TABLE `t_sportbase` DISABLE KEYS */;
INSERT INTO `t_sportbase` VALUES (1,'YD1001','步行（慢3km/h）','3','无'),(2,'YD1002','步行（中5km/h）','2','无'),(3,'YD1003','步行（快5.5-6km/h）','3','无'),(4,'YD1004','步行（很快7km/h）','3','无'),(5,'YD1007',' 写作（坐位）','1','无'),(6,'YD1008','书法/画画','1','无'),(7,'YD1009','上下楼','3','无'),(8,'YD1010','健身操（轻或中等强度）','3','无'),(9,'YD1011','广播体操','3','无'),(10,'YD1012','太极','2','无'),(11,'YD1013','瑜伽','3','无'),(12,'YD1015','慢跑','4','无'),(13,'YD1016','原地跑（8km/h）','4','无'),(14,'YD1017','跑步（9.6km/h）','','无'),(15,'YD1019','保龄球','2','无'),(16,'YD1020','台球','1','无'),(17,'YD1021','篮球(一般)','3','无'),(18,'YD1022','篮球（比赛）','4','无'),(19,'YD1023','排球（一般）','2','无'),(20,'YD1024','排球（比赛）','3','无'),(21,'YD1025','足球（一般）','4','无'),(22,'YD1026','足球（比赛）','4','无'),(23,'YD1027','乒乓球','3','无'),(24,'YD1028','网球（一般）','3','无'),(25,'YD1029','网球（双打）','3','无'),(26,'YD1030','网球（单打）','4','无'),(27,'YD1031','羽毛球（一般）','3','无'),(28,'YD1032','羽毛球（比赛）','4','无'),(29,'YD1033','跳绳（慢速）','4','无'),(30,'YD1034','跳绳（中速）','4','无'),(31,'YD1035','跳绳（快速）','4','无'),(32,'YD1036','舞蹈（慢速）','2','无'),(33,'YD1037','舞蹈（中速）','3','无'),(34,'YD1038','舞蹈（快速）','3','无'),(35,'YD1039','交际舞（慢）','2','无'),(36,'YD1040','交际舞（快）','3','无'),(37,'YD1041','有氧跳舞','3','无'),(38,'YD1042','游泳（一般）','3','无'),(39,'YD1043','自由泳（慢）','4','无'),(40,'YD1044','蛙泳（一般）','4','无'),(41,'YD1045','蝶泳（快）','4','无'),(42,'YD1046','轮滑旱冰','4','无'),(43,'YD1047','园艺','3','无'),(44,'YD1048','自行车（12km/h-16km/h）','3','无'),(45,'YD1049','自行车（16km/h-19km/h）','3','无'),(46,'YD1050','爬山','3','无'),(47,'YD1053','踏青','3','无'),(48,'YD1054','划船','3','无'),(49,'YD1055','逛街','1','无'),(50,'YD1056','钓鱼','3','无'),(51,'YD1057','下棋','1','无'),(52,'YD1058','遛狗','1','无'),(53,'YD1059','郊游','3','无'),(54,'YD1060','插花','1','无'),(55,'YD1061','家务（整理床，站立）','1','无'),(56,'YD1062','家务（洗碗）','1','无'),(57,'YD1063','家务（熨烫衣物）','1','无'),(58,'YD1064','家务（收拾餐桌）','1','无'),(59,'YD1065','家务（做饭）','1','无'),(60,'YD1066','家务（擦窗户）','2','无'),(61,'YD1067','家务（手洗衣服）','2','无'),(62,'YD1068','家务（扫地）','2','无'),(63,'YD1069','家务（扫院子）','2','无'),(64,'YD1070','家务（拖地板）','2','无'),(65,'YD1071','家务（吸尘）','2','无'),(66,'YD2001','跪式直背支撑','2','无'),(67,'YD2002','仰卧两头起','3','无'),(68,'YD2003','仰卧屈膝','2','无'),(69,'YD2004','仰卧抬腿','3','无'),(70,'YD2005','仰卧肘支撑后交叉腿','4','无'),(71,'YD2006','交叉腿侧身斜起坐','4','无'),(72,'YD2007','团身两头起','2','无'),(73,'YD2008','侧卧静力屈腿收腹','2','无'),(74,'YD2009','仰卧屈膝交叉腿抱头起','3','无'),(75,'YD2010','仰卧屈膝伸腿抱头起','4','无'),(76,'YD2011','仰卧交叉蹬腿','3','无'),(77,'YD2012','仰卧交叉打腿','3','无'),(78,'YD2013','仰卧举腿','3','无'),(79,'YD2014','俯卧三点静力支撑单手前平举','4','无'),(80,'YD2015','仰卧起坐','3','无'),(81,'YD2016','仰卧起扶膝静力坐','3','无'),(82,'YD2017','直腿臂上举坐','3','无'),(83,'YD2018','仰卧起静力手抱膝举腿','3','无'),(84,'YD2019','侧卧肘静力支撑手侧上举','3','无'),(85,'YD2020','仰卧起交叉提膝','4','无'),(86,'YD2021','坐式屈腿','3','无'),(87,'YD2022','仰卧举腿肘触膝','4','无'),(88,'YD2023','侧卧举腿','3','无'),(89,'YD2024','侧身手支撑伸展、踢腿','4','无'),(90,'YD2025','单肘侧支撑转体','3','无'),(91,'YD2026','俯卧静力手支撑换姿势','3','无'),(92,'YD2027','俯卧直臂支撑抬腿','3','无'),(93,'YD2028','侧卧屈腿抱头起','3','无'),(94,'YD2029','跪立侧俯身','3','无'),(95,'YD2030','俯卧肘脚支撑伸手收腿','4','无'),(96,'YD2031','直臂俯卧三点支撑','4','无'),(97,'YD2032','屈臂俯卧两点支撑','4','无'),(98,'YD2033','直臂俯卧两点支撑','4','无'),(99,'YD2034','直臂跪式单腿支撑','4','无'),(100,'YD2035','俯卧肘关节斜支撑','4','无'),(101,'YD2036','侧卧踢腿','4','无'),(102,'YD2037','仰卧提臀','4','无'),(103,'YD2038','仰卧提臀抬腿','4','无'),(104,'YD2039','仰卧勾腿提臀','4','无'),(105,'YD3001','颈部后侧的拉伸','1','无'),(106,'YD3002','缓解颈部紧张拉伸','1','无'),(107,'YD3003','缓解颈部紧张的拉伸','2','无'),(108,'YD3004','颈侧部的拉伸','1','无'),(109,'YD3005','肩膀和手臂的拉伸','1','无'),(110,'YD3006','前臂和手腕的拉伸','1','无'),(111,'YD3007','肩膀和手臂内侧的拉伸','1','无'),(112,'YD3008','肩膀外侧和手臂上部的拉伸','1','无'),(113,'YD3009','肱三头肌和肩膀上部的拉伸','2','无'),(114,'YD3010','腋窝部位和肩膀的拉伸','2','无'),(115,'YD3011','肩膀的拉伸','3','无'),(116,'YD3012','手臂的拉伸','1','无'),(117,'YD3013','肩膀的放松拉伸','1','无'),(118,'YD3014','肩膀、手臂和上背部的拉伸','1','无'),(119,'YD3015','颈部侧面的拉伸','1','无'),(120,'YD3016','肩膀、手臂和胸部的拉伸','3','无'),(121,'YD3017','肩膀前部和胸部的拉伸','1','无'),(122,'YD3018','肩膀前部和手臂的拉伸','3','无'),(123,'YD3019','上半身侧面、肩膀和手臂的拉伸','1','无'),(124,'YD3020','手腕的拉伸','1','无'),(125,'YD3021','手指的拉伸','1','无'),(126,'YD3022','手腕的放松拉伸','1','无'),(127,'YD3023','手指的放松拉伸','1','无'),(128,'YD3024','手腕和手指的放松','1','无'),(129,'YD3025','前臂内侧和手腕的拉伸','1','无'),(130,'YD3026','前臂、手腕的拉伸','1','无'),(131,'YD3027','手臂内侧的拉伸','1','无'),(132,'YD3028','手臂的坐位拉伸','1','无'),(133,'YD3029','手臂和侧腰的拉伸','1','无'),(134,'YD3030','上臂的坐位拉伸','2','无'),(135,'YD3031','肩膀和上背部的拉伸','1','无'),(136,'YD3032','上背部和颈部的拉伸','1','无'),(137,'YD3033','前臂的拉伸','1','无'),(138,'YD3034','颈部的拉伸','1','无'),(139,'YD3035','脸部的放松拉伸','1','无'),(140,'YD3036','抬升双脚时的颈部拉伸','4','无'),(141,'YD3037','腹股沟的拉伸','1','无'),(142,'YD3038','腹股沟和髋部的拉伸','1','无'),(143,'YD3039','腰部、髋上部及侧部的拉伸','1','无'),(144,'YD3040','腰部、款上部及侧部拉伸','1','无'),(145,'YD3041','腿部和背部的拉伸','2','无'),(146,'YD3042','腿部及背部拉伸','2','无'),(147,'YD3043','腿部及背部的拉伸','2','无'),(148,'YD3044','腿部内侧的拉伸','2','无'),(149,'YD3045','腰部和髋侧部的拉伸','2','无'),(150,'YD3046','脚踝的坐位拉伸','1','无'),(151,'YD3047','脚趾的坐位拉伸','1','无'),(152,'YD3048','大腿后腱和髋部的拉伸','2','无'),(153,'YD3049','臀部的拉伸','2','无'),(154,'YD3050','脚踝和大腿前侧的拉伸','2','无'),(155,'YD3051','大腿外侧的拉伸','2','无'),(156,'YD3052','坐位股四头肌拉伸','2','无'),(157,'YD3053','大腿后侧的拉伸','3','无'),(158,'YD3054','腰部和肩胛区中部的拉伸','3','无'),(159,'YD3055','小腿后侧的拉伸','3','无'),(160,'YD3056','膝盖、脚踝和股四头肌的拉伸','2','无'),(161,'YD3057','脚趾和脚底的拉伸','2','无'),(162,'YD3058','跟腱部位和脚踝的拉伸','2','无'),(163,'YD3059','髋前部的拉伸','3','无'),(164,'YD3060','髋部、腰部的拉伸','3','无'),(165,'YD3061','加强髋部柔韧性的拉伸','3','无'),(166,'YD3062','骨盆部位的拉伸','3','无'),(167,'YD3063','骨盆和髋部的拉伸','3','无'),(168,'YD3064','大腿后部和腘窝的拉伸','2','无'),(169,'YD3065','腰部和大腿后部的拉伸','3','无'),(170,'YD3066','大腿后部和小腿后部的拉伸','3','无'),(171,'YD3067','腹股沟的坐位拉伸','3','无'),(172,'YD3068','下蹲拉伸','2','无'),(173,'YD3069','腹股沟的下蹲拉伸','3','无'),(174,'YD3070','脚踝的站位拉伸','1','无'),(175,'YD3071','小腿后侧的站位拉伸','2','无'),(176,'YD3072','跟腱的站位拉伸','2','无'),(177,'YD3073','跟腱和脚踝的拉伸','2','无'),(178,'YD3074','髋侧部的拉伸','2','无'),(179,'YD3075','大腿内侧的站位拉伸','2','无'),(180,'YD3076','髋侧部的站位拉伸','3','无'),(181,'YD3077','大腿后腱上部、臀部和髋部的拉伸','3','无'),(182,'YD3078','腹股沟、大腿后腱和髋前部的拉伸','3','无'),(183,'YD3079','髋前部和股四头肌的拉伸','3','无'),(184,'YD3080','大腿后侧的站位拉伸','3','无'),(185,'YD3081','大腿内侧的拉伸','3','无'),(186,'YD3082','大腿后侧和内侧的拉伸','4','无'),(187,'YD3083','腰部、髋部的拉伸','3','无'),(188,'YD3084','脚踝的拉伸','1','无'),(189,'YD3085','大腿后侧和外侧的拉伸','1','无'),(190,'YD3086','髋外侧的拉伸','3','无'),(191,'YD3087','抬升双脚时的腿部内侧拉伸','4','无'),(192,'YD3088','大腿内侧和腹股沟的拉伸','4','无'),(193,'YD3089','腿部后侧的拉伸','4','无'),(194,'YD3090','腿部内侧和髋部的拉伸','4','无'),(195,'YD3091','向前劈叉','4','无'),(196,'YD3092','横向劈叉','4','无'),(197,'YD3093','挤压肩胛部的拉伸','1','无'),(198,'YD3094','使腰部变平坦的拉伸','1','无'),(199,'YD3095','挤压肩胛部和收紧臀肌的拉伸','2','无'),(200,'YD3096','伸长拉伸','1','无'),(201,'YD3097','舒展背部和腰部的拉伸','1','无'),(202,'YD3098','身体侧面的拉伸','1','无'),(203,'YD3099','脊柱周边肌肉群的拉伸','3','无'),(204,'YD3100','侧腰的拉伸','3','无'),(205,'YD3101','腰部的坐位拉伸','2','无'),(206,'YD3102','脊柱的拉伸','4','无'),(207,'YD3103','腿部和腰部的拉伸','4','无'),(208,'YD3104','腿部和侧腰部的拉伸','4','无'),(209,'YD3105','腰部的拉伸','1','无'),(211,'11','11','11','11');
/*!40000 ALTER TABLE `t_sportbase` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_user`
--

DROP TABLE IF EXISTS `t_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_user` (
  `id` int NOT NULL AUTO_INCREMENT,
  `birthday` date DEFAULT NULL,
  `gender` varchar(1) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `username` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `password` varchar(256) CHARACTER SET utf8mb3 COLLATE utf8_general_ci NOT NULL,
  `remark` varchar(32) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `station` varchar(1) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  `telephone` varchar(11) CHARACTER SET utf8mb3 COLLATE utf8_general_ci DEFAULT NULL,
  PRIMARY KEY (`id`,`username`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_user`
--

LOCK TABLES `t_user` WRITE;
/*!40000 ALTER TABLE `t_user` DISABLE KEYS */;
INSERT INTO `t_user` VALUES (1,'2020-08-03','2','admin','$2a$10$W4pNuuUIQj0U2MfX9dwScOIFJEe.88wWfI.IXs1hHEm24wZZiKHo6',NULL,'1',NULL),(2,'1999-09-19','1','xiaoming','$2a$10$LytoOIFTyjqWqSgaY5NrIeqg0Na632pDilCoKQ5m/qM/vSl930X8y',NULL,'2',NULL),(12,'2021-05-05','1','gly','$2a$10$WmS05xvimtu4MvBmBI/XCeVLg1IVEwDz2mlSZ0WDVAbHck/MMEgQa',NULL,'1',NULL),(13,'2021-05-03','1','gls','$2a$10$jFOZWay5CUj4xJQjF2YCSunKYSpURRdDHxn6ZkP5D5yjru.w41qZu',NULL,'1','18834121212'),(15,NULL,'1','111','$2a$10$htED3GRZS/QMtg0hlrmJ0u5XwMgJF/0xc4TDSG6yLED3yN9dM6Xwy',NULL,'1','18834161276');
/*!40000 ALTER TABLE `t_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_user_role`
--

DROP TABLE IF EXISTS `t_user_role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_user_role` (
  `user_id` int NOT NULL,
  `role_id` int NOT NULL,
  PRIMARY KEY (`user_id`,`role_id`) USING BTREE,
  KEY `FK_Reference_8` (`role_id`) USING BTREE,
  CONSTRAINT `FK_Reference_7` FOREIGN KEY (`user_id`) REFERENCES `t_user` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `FK_Reference_8` FOREIGN KEY (`role_id`) REFERENCES `t_role` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_user_role`
--

LOCK TABLES `t_user_role` WRITE;
/*!40000 ALTER TABLE `t_user_role` DISABLE KEYS */;
INSERT INTO `t_user_role` VALUES (1,1),(2,2),(13,2),(12,7);
/*!40000 ALTER TABLE `t_user_role` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'health'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-07-17 23:31:24
